[{"objectID":"195","title":"Your Work, Made Easier","content":"If you could improve security, teamwork, performance and cost all at once, would you do it? It’s true! We can help you improve your business with Google’s easy to learn, easy to use business software. Get a tightly integrated solution for your Company that's secure, reliable, easy to use, powerful and includes 24\/365 support by Google. Don't let technology impede your business!","excerpt":"If you could improve security, teamwork, performance and cost all at once, would you do it? It’s true! We can..","path":"\/"},{"objectID":"272","title":"Why Use easyG?","content":"Your technology services will be provisioned and maintained by credentialed experts using best practices. The email messages sent from your Domain will be authenticated, which eliminates spoofing, improves your domain reputation and protects your message recipients. Multi factor authentication will be enforced, providing a crucial second layer of security for your business.","excerpt":"Google Workspace has been our primary business tool since 2006. easyg Cloud has been a Google Cloud Partner since 2011.","path":"\/why\/"},{"objectID":"183","title":"Services","content":"Flexible Monthly licensesBasic supportBasic securityBest practices","excerpt":"Google Workspace has been our primary business tool since 2006. easyG cloud has been a Google Cloud Partner since 2011","path":"\/services\/"},{"objectID":"708","title":"Time &#038; project management in Google Docs","content":"Improve time management and display time with new chips in Google Docs\nIn addition to the recent introduction of new smart canvas features in Google Sheets and Google Docs, we’re adding new timer chips that can be used to timebox activities and ensure that you’re using your time productively.","excerpt":"Improve time management and display time with new chips in Google Docs In addition to the recent introduction of new..","path":"\/uncategorized\/time-project-management-in-google-docs\/"},{"objectID":"132","title":"Google Voice","content":"Google Voice\nIf your work days are filled with email, text, voice, messenger, chat &amp; tweets, you know more channels make it harder to stay connected &amp; organized. There are more phone numbers than people in the world, so voice communication is still the most universal way to connect. Combining communication channels is a great way to improve efficiency, and now you can integrate SMS, chat, voice, video, and calendar by adding Google Voice to Google Workspace.\nThis means getting rid of all your on premise legacy telephony hardware (unless you want to keep a traditional phone on your desk). Google Voice is an easy to deploy, easy to administer, easy to use voice solution that makes calls easier. Make and receive calls with your work number on any device. Focus on what's important while staying connected on deskphones, smartphones, and the web. Powerful artificial intelligence filters out spam calls &amp; transcribes voicemail.\nGain control of your most valuable resource; your time. Even telephone number porting is integrated and streamlined. Stop spending time managing multiple vendor contracts and streamline your operations with the unified communications of Google Workspace and Google Voice.","excerpt":"Google Voice If your work days are filled with email, text, voice, messenger, chat &amp; tweets, you know more channels..","path":"\/video\/google-voice-by-g-suite\/"},{"objectID":"601","title":"I want to sign up for Google Workspace with my own domain name. Is this possible?","content":"Absolutely. If you already have a company domain name, or need to create a new one, Google Workspace can meet your needs. Each user at your domain will get a Workspace account branded with your own domain name. Email addresses take the format 'username@yourdomain.com.'","excerpt":"Absolutely. If you already have a company domain name, or need to create a new one, Google Workspace can meet..","path":"\/faq-item\/sign-up-for-workspace-my-own-domain-name\/"},{"objectID":"608","title":"Does Google host websites too?","content":"Google Sites is designed to make it easy for your team to create and collaborate on internal sites for their projects and departments. You can make Google Sites public, but most organizations prefer specialized website development and hosting platforms for their public sites.\nIf you're looking for modern website solutions for your public web site, you may want to consider jamstack or static website solutions. We can help!","excerpt":"Google Sites is designed to make it easy for your team to create and collaborate on internal sites for their..","path":"\/faq-item\/does-google-host-websites-too\/"},{"objectID":"343","title":".CSV","content":"Is an acronym for \"Comma-Separated Value\" and a file format. This file format represents tabular data in text form. Rows are represented by new lines and cells are separated by commas.","excerpt":"Is an acronym for \"Comma-Separated Value\" and a file format. This file format represents tabular data in text form. Rows..","path":"\/glossary\/csv\/"},{"objectID":"302","title":"A Record","content":"Address or A records (also known as host records) are the central records of DNS. These records link a domain to an IP address. You need A records if you want to forward your naked domain in Google Workspace.","excerpt":"Address or A records (also known as host records) are the central records of DNS. These records link a domain..","path":"\/glossary\/a-record\/"},{"objectID":"304","title":"Abuse","content":"Abuse is a reserved username and Google monitors abuse@yourdomain.com.","excerpt":"Abuse is a reserved username and Google monitors abuse@yourdomain.com.","path":"\/glossary\/abuse\/"},{"objectID":"306","title":"Account Type","content":"Refers to an edition; Legacy Google Workspace, Google Workspace, Google Workspace for Education or Google Workspace for Government.","excerpt":"Refers to an edition; Legacy Google Workspace, Google Workspace, Google Workspace for Education or Google Workspace for Government.","path":"\/glossary\/account-type\/"},{"objectID":"319","title":"Admin console","content":"This is the web based tool administrators may use to manage Google Workspace, Android and Chrome devices, and other Enterprise products and services. Learn more about the admin console with this video.","excerpt":"This is the web based tool administrators may use to manage Google Workspace, Android and Chrome devices, and other Enterprise..","path":"\/glossary\/admin-console\/"},{"objectID":"317","title":"Administrator Account","content":"This account is used to manage the domain, create user accounts, publish web pages, customize URLs and your domain's start page, and much more. The user(s) who have access to these accounts are called an administrator or admin. There are multiple permissions levels for administrator accounts with the highest level being called the \"Super Administrator\".","excerpt":"This account is used to manage the domain, create user accounts, publish web pages, customize URLs and your domain's start..","path":"\/glossary\/administrator-account\/"},{"objectID":"321","title":"Alias","content":"See Domain Alias.","excerpt":"See Domain Alias.","path":"\/glossary\/alias\/"},{"objectID":"323","title":"API","content":"API is an acronym for \"Application Program Interface\". There are several Google Workspace administrative APIs.","excerpt":"API is an acronym for \"Application Program Interface\". There are several Google Workspace administrative APIs.","path":"\/glossary\/323\/"},{"objectID":"329","title":"Attachment routing","content":"See content routing.","excerpt":"See content routing.","path":"\/glossary\/attachment-routing\/"},{"objectID":"365","title":"Content routing or attachment routing","content":"Define mail routes based on message content or attachment type.","excerpt":"Define mail routes based on message content or attachment type.","path":"\/glossary\/content-routing-or-attachment-routing\/"},{"objectID":"122","title":"Check out Google Workspace","content":"","excerpt":"","path":"\/google-enterprise\/check-out-g-suite\/"},{"objectID":"119","title":"Action items are better than attachments","content":"Employees spend about 20% of their time at work searching for information. Make teamwork easier with Google files by assigning action items to people instead of sending attachments.\n\n&nbsp;In Docs, Sheets and Slides just mention their name in a comment (G Suite may help you) and check the Action Item box. The assignee will get an email notification and see the Action Item(s) highlighted with a blue bar when they open the file. Learn more","excerpt":"Employees spend about 20% of their time at work searching for information. Make teamwork easier with Google files by assigning..","path":"\/tips-tricks\/action-items-are-better-than-attachments\/"},{"objectID":"131","title":"Reimagine how your team works","content":"Reimagine how your team works","excerpt":"Reimagine how your team works","path":"\/video\/reimagine-how-your-team-works\/"},{"objectID":"89","title":"Van Teal evolves from Novell Groupwise to Google Apps for Business","content":"","excerpt":"","path":"\/easygapps\/van-teal-evolves-from-novell-groupwise-to-google-apps-for-business\/"},{"objectID":"88","title":"Brittex Appraisal Services streamlines workflow with Google Apps for Business","content":"","excerpt":"","path":"\/easygapps\/brittex-appraisal-services-streamlines-workflow-with-google-apps-for-business\/"},{"objectID":"91","title":"Pain free conference calls","content":"Pain Free Conference Calls\nSchedule conferences that call people\nParticipants simply receive the call&nbsp;\nPowerful web interface shows&nbsp;who's speaking&nbsp;\n\nShare your screen and your files\nRelax &amp; enjoy high definition audio\nFree Trial Codes Available","excerpt":"Pain Free Conference Calls Schedule conferences that call people Participants simply receive the call&nbsp; Powerful web interface shows&nbsp;who's speaking&nbsp; Share..","path":"\/video\/pain-free-conference-calls\/"},{"objectID":"73","title":"Google Workspace Case Studies","content":"G Suite Case Studies","excerpt":"G Suite Case Studies","path":"\/google-enterprise\/google-apps-case-studies\/"},{"objectID":"42","title":"Google Apps Tips and Tricks","content":"G Suite Tips and Tricks","excerpt":"G Suite Tips and Tricks","path":"\/tips-tricks\/google-apps-tips-and-tricks\/"},{"objectID":"41","title":"Work Smarter","content":"Work Smarter with G Suite","excerpt":"Work Smarter with G Suite","path":"\/video\/work-smarter\/"},{"objectID":"46","title":"Manage Mobile Users","content":"Manage Mobile Users","excerpt":"Manage Mobile Users","path":"\/video\/manage-mobile-users\/"},{"objectID":"47","title":"What its like Going Google","content":"What it's like going Google","excerpt":"What it's like going Google","path":"\/video\/what-its-like-going-google\/"},{"objectID":"50","title":"Group Collaborative Inbox","content":"Group Collaborative Inbox","excerpt":"Group Collaborative Inbox","path":"\/video\/group-collaborative-inbox\/"},{"objectID":"53","title":"Google Cloud Security","content":"Google Security","excerpt":"Google Security","path":"\/video\/google-security\/"},{"objectID":"54","title":"Priority Inbox","content":"Priority Inbox\n&nbsp;\nWhat's your email inbox type? Many people are uncomfortable with their inbox. Most use Outlook or Google mail. Both list messages in the order received, but there's a better way! Want to see your important messages first? The same service that powers the world's best spam filter can also help&nbsp;organize you. The first step to organize your inbox is to try a different inbox type. Just beneath Google mail’s compose button, hover over the \"Inbox\" label and tap on the black triangle to the right. Try selecting Important first, which identifies and separates important incoming messages. After a quick refresh your messages split into two sections: Important and Everything else. You may notice the number of unread messages drops. That's because that number now only reflects messages that are both unread and important.\nThe result is a more organized inbox with your important messages on top. Google mail ranks messages based on your contacts, who you’ve written to and which keywords appear in messages. You can help train your inbox to classify messages better by clicking importance markers to the right of your star markers. A &nbsp; gold marker means a message is important. An  empty marker means a message is not important. To learn why a message ranks as important, hover over the marker to see the main reason. If Google mail mistakes a message as important or doesn’t mark one that’s important to you, teach it to make better selections. Just mark the message to move it to the correct section. Over time Google mail will use your feedback to learn what’s important to you. The more you use this feature, the more accurate importance ranking will become. For even more control, try Priority Inbox, which is like Important first and also offers two more sections. You may also synchronize your mobile device to your preferred inbox type. This lets you focus on important messages, saves time, keeps you organized, and helps you feel more comfortable with your inbox.","excerpt":"Priority Inbox &nbsp; What's your email inbox type? Many people are uncomfortable with their inbox. Most use Outlook or Google..","path":"\/video\/priority-inbox\/"},{"objectID":"58","title":"Going Google","content":"Going Google","excerpt":"Going Google","path":"\/video\/going-google\/"},{"objectID":"65","title":"Gmail Advanced Search","content":"Gmail Advanced Search","excerpt":"Gmail Advanced Search","path":"\/video\/gmail-advanced-search\/"},{"objectID":"66","title":"Hangout video meeting","content":"Hangout Video Meeting\nMeet with up to 25 people or stream live to the world!","excerpt":"Hangout Video Meeting Meet with up to 25 people or stream live to the world!","path":"\/video\/hangout-video-meeting\/"},{"objectID":"83","title":"Inbox Zero","content":"Tips for getting to inbox zero","excerpt":"Tips for getting to inbox zero","path":"\/video\/inbox-zero\/"},{"objectID":"86","title":"Use Forms in Google Drive","content":"Use Forms in Google Drive","excerpt":"Use Forms in Google Drive","path":"\/video\/use-forms-in-google-drive\/"},{"objectID":"114","title":"Explore a Google Data Center","content":"Explore a Google Data Center","excerpt":"Explore a Google Data Center","path":"\/video\/explore-a-google-data-center\/"},{"objectID":"97","title":"Google Workspace makes work easier","content":"Google Apps for Work","excerpt":"Google Apps for Work","path":"\/video\/google-apps-makes-work-easier\/"},{"objectID":"1","title":"Recommendations","content":"“Douglas is extremely knowledgable in his field and he offers amazing and thorough services.”&nbsp;October 18, 2011\nTop qualities:&nbsp;Great Results, Personable, Expert\nVanessa Briones,&nbsp;hired Douglas as a IT Consultant in 2011\n&nbsp;\n“I am pleased to write a letter of reference for Doug Baumwall. Doug is an expert in Google Apps. Doug was able to provide assistance to me with migrating my hosting of mail on my server to the “cloud” with Google mail. Also, the calendar, documents, sites, and contacts are also part of this program which is extremely useful.&nbsp;The move has been great and we were able to transition to Google Apps easily with Doug’s help. We are using Gmail exclusively with all the advantages of the email program. Not only was Doug able to provide support during the transition, he has continued to provide support to me both on site and remotely. He was able to show me numerous time saving aspects of the program.&nbsp;His follow up work is excellent, and I have referred numerous clients to Doug and his Firm.”October 18, 2011\nTop qualities:&nbsp;Great Results, Expert, Good Value\nBritt J. Rosen, CCIM,&nbsp;hired Douglas as a Business Consultant in 2011\n&nbsp;\n“Great Service and Knowlegable”&nbsp;October 10, 2011\nTop qualities:&nbsp;Great Results, Expert, On Time\nSteve Giachello,&nbsp;hired Douglas as a IT Consultant in 2010, and hired Douglas more than once\n&nbsp;\n“Doug is an expert at Google Apps - but more importantly, Doug shows incredible customer service. he takes my calls anytime any day and I really appreciate that. Customer service is something that you dont see a lot of but with Doug, you are going to get great service. Not to mention he is an expert at everything that has to do with Google Apps.”&nbsp;October 10, 2011\nTop qualities:&nbsp;Personable, Expert, High Integrity\nTodd Paton,&nbsp;hired Douglas as a IT Consultant in 2011\n&nbsp;\n“I would recommend Douglas for all your internet needs. His knowledge and ideas helped me improve my business and save time and money for me. His patience allowed me to learn at my own speed. He will deliver on time and at a great price!!! Thank you Doug.....&nbsp;Debi Quade”&nbsp;September 13, 2011\nTop qualities:&nbsp;Great Results, Expert, High Integrity\nDebi Quade,&nbsp;hired Douglas as a IT Consultant in 2010, and hired Douglas more than once\n&nbsp;\n“I have known Douglas for almost 20 years and worked with him in a variety of business dealings and projects. Douglas recently helped me convert to Google Apps. He is very knowledgeable about all details of the product and the implementation process. Douglas is a trusted adviser and a pleasure to work with.”&nbsp;August 19, 2011\nTop qualities:&nbsp;Expert, On Time, High Integrity\nL. Gregory Loomar, Esquire,&nbsp;hired Douglas as a Business Consultant in 2011\n&nbsp;\n“Doug created immediate value by implementing Google Apps for our office. He guided me through the issues I didn't understand and provided explanations that were straight-forward and easy to understand. I definitely recommend his services.”&nbsp;July 25, 2011\nTop qualities:&nbsp;Great Results, Personable, Expert\nPatrick Gelineau,&nbsp;hired Douglas as a IT Consultant in 2011, and hired Douglas more than once\n&nbsp;\n“Doug provides real value-added services because he is always looking for ways to enhance my business and my business efficiency. Doug's experience is an incredible benefit.”&nbsp;May 15, 2011\nTop qualities:&nbsp;Personable, Expert, Creative\nBob Arnold,&nbsp;hired Douglas as a IT Consultant in 2010\n&nbsp;\n“Thank you Doug for Bringing our Company to the 21St Century!&nbsp;We will only use Google Apps in the Future.”&nbsp;May 12, 2011\nTop qualities:&nbsp;Great Results, Personable, Expert\nElizabeth Karwowski,&nbsp;hired Douglas as a IT Consultant in 2011, and hired Douglas more than once\n&nbsp;\n“Very thorough and attentive to detail. A good partner.”&nbsp;May 11, 2011\nTop qualities:&nbsp;Great Results, Personable, Expert\nDominic Mylne,&nbsp;hired Douglas as a IT Consultant in 2010","excerpt":"“Douglas is extremely knowledgable in his field and he offers amazing and thorough services.”&nbsp;October 18, 2011 Top qualities:&nbsp;Great Results, Personable,..","path":"\/easygapps\/recommendations\/"},{"objectID":"377","title":"DMARC","content":"Is an acronym for \"Domain-based Message Authentication, Reporting &amp; Conformance\". It is a technical standard that helps protect email senders and recipients from spam, spoofing, and phishing. A DMARC policy is published to request feedback from receiving email servers and to tell them what to do with messages that are not authenticated by the sending domain. DMARC builds upon both the DomainKeys Identified Mail (DKIM) and Sender Policy Framework (SPF) specifications. Policies include \"none\", \"quarantine\", or \"reject\".\n&nbsp;","excerpt":"Is an acronym for \"Domain-based Message Authentication, Reporting &amp; Conformance\". It is a technical standard that helps protect email senders and..","path":"\/glossary\/dmarc\/"},{"objectID":"421","title":"Google Workspace (formerly G Suite) plans","content":"Currently there are five commercial pricing plans offered: Business Starter, Business Standard, Business Plus, Enterprise Standard and Enterprise Plus.","excerpt":"Currently there are five commercial pricing plans offered: Business Starter, Business Standard, Business Plus, Enterprise Standard and Enterprise Plus.","path":"\/glossary\/google-workspace-formerly-g-suite-editions\/"},{"objectID":"443","title":"Google Cloud Partner","content":"The Google Cloud Partner Program gives qualified Companies with Certified and Credentialed Technicians the authority to sell Google Cloud, Google Workspace and related services like setup, implementation, migration, training, support, and organizational change management.","excerpt":"The Google Cloud Partner Program gives qualified Companies with Certified and Credentialed Technicians the authority to sell Google Cloud, Google..","path":"\/glossary\/google-cloud-partner\/"},{"objectID":"427","title":"Google Cloud Partners","content":"Trusted Companies that employ certified technicians and that are authorized to help organizations adopt Google Workspace web based tools, replacing existing legacy systems and IT infrastructure.","excerpt":"Trusted Companies that employ certified technicians and that are authorized to help organizations adopt Google Workspace web based tools, replacing..","path":"\/glossary\/google-cloud-partners\/"},{"objectID":"433","title":"Google Workspace Migration for Microsoft Exchange","content":"Complete migration of email, contacts, calendars, and files from your Microsoft 365 accounts to Google Workspace accounts.","excerpt":"Complete migration of email, contacts, calendars, and files from your Microsoft 365 accounts to Google Workspace accounts.","path":"\/glossary\/google-workspace-migration-for-microsoft-exchange\/"},{"objectID":"325","title":"Status Dashboard","content":"Displays performance information for Google Workspace services: google.com\/appsstatus","excerpt":"Displays performance information for Google Workspace services: google.com\/appsstatus","path":"\/glossary\/status-dashboard\/"},{"objectID":"331","title":"Auto-forwarding","content":"A feature of Gmail used to redirect some or all of your messages to another email address.","excerpt":"A feature of Gmail used to redirect some or all of your messages to another email address.","path":"\/glossary\/auto-forwarding\/"},{"objectID":"333","title":"Automatic Renewal","content":"An option in the admin console that allows automatic renewal of domain subscription after one year from the date of account creation or last domain renewal.","excerpt":"An option in the admin console that allows automatic renewal of domain subscription after one year from the date of..","path":"\/glossary\/automatic-renewal\/"},{"objectID":"335","title":"BIMI","content":"Is an acronym for \"Brand Indicators for Message Identification\". BIMI (pronounced: Bih-mee) is an emerging email specification that enables the use of brand-controlled logos within supporting email clients. BIMI leverages the work an organization has put into deploying DMARC protection, by bringing brand logos to the customer’s inbox. For the brand’s logo to be displayed, the email must pass DMARC authentication checks, ensuring that the organization’s domain has not been impersonated.","excerpt":"Is an acronym for \"Brand Indicators for Message Identification\". BIMI (pronounced: Bih-mee) is an emerging email specification that enables the..","path":"\/glossary\/bimi\/"},{"objectID":"337","title":"Browser","content":"A web browser is the application you use to view websites. The web browser is arguably the most important piece of software on your computer. You spend much of your time online inside a browser: When you search, chat, email, shop, bank, read the news, and watch videos online, you often do all this using a browser. Internet Explorer is Microsoft's web browser. Chrome is Google's web browser.","excerpt":"A web browser is the application you use to view websites. The web browser is arguably the most important piece..","path":"\/glossary\/browser\/"},{"objectID":"339","title":"Bulk Account Update","content":"This feature allows you to create and update many user accounts at the same time with a .csv file.","excerpt":"This feature allows you to create and update many user accounts at the same time with a .csv file.","path":"\/glossary\/bulk-account-update\/"},{"objectID":"341","title":"Blogger Custom Domain","content":"Use a custom domain name for your blog.","excerpt":"Use a custom domain name for your blog.","path":"\/glossary\/blogger-custom-domain\/"},{"objectID":"345","title":"Catch-all Address","content":"A catch-all address will allow you to receive any mail sent to your domain that doesn't match an existing alias.","excerpt":"A catch-all address will allow you to receive any mail sent to your domain that doesn't match an existing alias.","path":"\/glossary\/catch-all-address\/"},{"objectID":"347","title":"Chat","content":"Also known as Instant messaging. If chat is enabled by your administrator for your domain, you may download the chat app and use your e-mail account's chat features to talk to people from directly within your inbox.","excerpt":"Also known as Instant messaging. If chat is enabled by your administrator for your domain, you may download the chat..","path":"\/glossary\/chat\/"},{"objectID":"349","title":"Chrome browser","content":"Google's fast, free web browser. Chrome is the best way to use Google Workspace!","excerpt":"Google's fast, free web browser. Chrome is the best way to use Google Workspace!","path":"\/glossary\/chrome-browser\/"},{"objectID":"351","title":"Chrome remote desktop","content":"Access other computers or allows another user to access your computer securely over the Internet: chrome.google.com\/remotedesktop.","excerpt":"Access other computers or allows another user to access your computer securely over the Internet: chrome.google.com\/remotedesktop.","path":"\/glossary\/chrome-remote-desktop\/"},{"objectID":"353","title":"Chromebook","content":"Fast, intuitive and easy-to-manage computer designed to keep data and users safe while delivering all the power of the web. Chromebooks look like laptops but have six to eight hour battery life, and go from off to the web in eight to ten seconds!","excerpt":"Fast, intuitive and easy-to-manage computer designed to keep data and users safe while delivering all the power of the web...","path":"\/glossary\/chromebook\/"},{"objectID":"355","title":"Cloud computing","content":"Cloud computing is internet-based computing in which large groups of remote computer servers are networked to serve resources more efficiently. This network is shared and not tied to any specific location. Cloud Computing is for software developers, application vendors, savvy computer users, and corporate IT departments, not for end-users of software applications. It basically consists of:\n\nVirtual computers\/servers\nData storage capacity\nCommunication\/messaging capacity\nNetwork capacity\nDevelopment environments","excerpt":"Cloud computing is internet-based computing in which large groups of remote computer servers are networked to serve resources more efficiently...","path":"\/glossary\/cloud-computing\/"},{"objectID":"357","title":"CNAME Record","content":"Canonical Name or CNAME records link an alias name to another canonical domain name. For instance, www.example.com might link to example.com. You'll need to use CNAME records if you want to configure a custom URL for specific Google Workspace services or a Google Site (like sites.mydomain.com).","excerpt":"Canonical Name or CNAME records link an alias name to another canonical domain name. For instance, www.example.com might link to..","path":"\/glossary\/cname-record\/"},{"objectID":"359","title":"Consumerization","content":"Is the growing tendency for new information technology to emerge first in the consumer market and then spread into business and government organizations. The emergence of consumer markets as the primary driver of IT innovation has reached the tipping point in the shift away from traditional IT created by big business and government organizations.","excerpt":"Is the growing tendency for new information technology to emerge first in the consumer market and then spread into business..","path":"\/glossary\/consumerization\/"},{"objectID":"361","title":"Contact Information","content":"Your contact email addresses (in Account information under Domain settings) for all official service communications including password recovery and payment notifications.","excerpt":"Your contact email addresses (in Account information under Domain settings) for all official service communications including password recovery and payment..","path":"\/glossary\/contact-information\/"},{"objectID":"363","title":"Contact Sharing","content":"This feature populates a user's Contacts list with all users at your domain, suggests users' email addresses with auto-complete, and allows users to chat with a convenient Quick Contacts list.","excerpt":"This feature populates a user's Contacts list with all users at your domain, suggests users' email addresses with auto-complete, and..","path":"\/glossary\/contact-sharing\/"},{"objectID":"367","title":"Conversations or Conversation View","content":"One of the important features that differentiates Gmail from on-premise email software like Outlook. Conversations is a term used to describe Gmail's approach to organizing messages that are sent back and forth which share the same subject. Gmail stacks all messages with the same subject in one place, making it easier to understand the context of each message and the meaning of messages as a group. In legacy email software, each message response appears separately, forcing you to wade through your entire inbox to follow the conversation. Although this may initially look confusing to Outlook users, Conversation View allows people to quickly organize their inbox and become more productive. This feature is controlled at the domain level by administrators and may also be turned on and off by individual users.","excerpt":"One of the important features that differentiates Gmail from on-premise email software like Outlook. Conversations is a term used to..","path":"\/glossary\/conversations-or-conversation-view\/"},{"objectID":"369","title":"Custom Logo","content":"You can choose your own logo to be displayed on all services for your domain. Uploading your own logo will replace the default Google and Gmail logos.","excerpt":"You can choose your own logo to be displayed on all services for your domain. Uploading your own logo will..","path":"\/glossary\/custom-logo\/"},{"objectID":"371","title":"Custom URL","content":"Custom URLs, or short URLs, make using the Internet easier. You and your users can access services with a simple, easy-to-remember address. Your custom URLs will follow this format: http:\/\/[customize this section].your_domain.com, and redirect to a login page.","excerpt":"Custom URLs, or short URLs, make using the Internet easier. You and your users can access services with a simple,..","path":"\/glossary\/custom-url\/"},{"objectID":"373","title":"Direct delivery","content":"By default, Google Workspace mail servers deliver incoming mail to the Gmail inbox of the recipient. If a message is addressed to a user in your domain that is not registered in Google Workspace, the mail server discards the message.","excerpt":"By default, Google Workspace mail servers deliver incoming mail to the Gmail inbox of the recipient. If a message is..","path":"\/glossary\/direct-delivery\/"},{"objectID":"375","title":"DKIM","content":"Is an acronym for \"DomainKeys Identified Mail\". It is a method for associating a domain name with an e-mail, thereby allowing an organization to take responsibility for a message in a way that can be validated by a recipient. The validation technique is based on public-key cryptography.","excerpt":"Is an acronym for \"DomainKeys Identified Mail\". It is a method for associating a domain name with an e-mail, thereby..","path":"\/glossary\/dkim\/"},{"objectID":"379","title":"DNS","content":"Is an acronym for \"Domain Name System\". DNS is a hierarchical distributed database that lets you store IP addresses and other data and look it up by name. This is the system that organizes and identifies domains. DNS is the \"phone book\" of the web. While a phone book translates a name like “Acme Pizza” into the right phone number to call, the DNS translates a URL (like \"http:\/\/EasygCloud.com\") into an IP address (like “74.125.239.137”). For some Google Workspace functionality, you need to adjust DNS records of your domain. For example, DNS is used to determine where to deliver email for your domain via mail exchange (MX) records.","excerpt":"Is an acronym for \"Domain Name System\". DNS is a hierarchical distributed database that lets you store IP addresses and..","path":"\/glossary\/dns\/"},{"objectID":"381","title":"Domain Alias","content":"Domain aliases are additional domain names associated with your primary domain. You can add a domain alias that receives mail and delivers it to mailboxes at your primary domain. See Basic Guide to DNS","excerpt":"Domain aliases are additional domain names associated with your primary domain. You can add a domain alias that receives mail..","path":"\/glossary\/domain-alias\/"},{"objectID":"383","title":"Domain Host","content":"Domain hosts run DNS servers for your domain. This includes A records, MX records, and CNAME records. See Basic Guide to DNS","excerpt":"Domain hosts run DNS servers for your domain. This includes A records, MX records, and CNAME records. See Basic Guide..","path":"\/glossary\/domain-host\/"},{"objectID":"385","title":"Domain Name","content":"Domain names are easy-to-remember names (ex. blueshirt.com or organicfood.org) that are associated with one or more IP addresses. Since a web page is defined by its URL, the page can move to a different IP address without affecting visitors. See Basic Guide to DNS","excerpt":"Domain names are easy-to-remember names (ex. blueshirt.com or organicfood.org) that are associated with one or more IP addresses. Since a..","path":"\/glossary\/domain-name\/"},{"objectID":"387","title":"Domain Registrar","content":"Domain registrars sell Internet domain names (ex. blueshirt.com or organicfood.org ). Most of these companies offer a hosting service in addition to registration. See Basic Guide to DNS","excerpt":"Domain registrars sell Internet domain names (ex. blueshirt.com or organicfood.org ). Most of these companies offer a hosting service in..","path":"\/glossary\/domain-registrar\/"},{"objectID":"389","title":"Domain Ownership","content":"Accrues to the person or organization who registered the domain. For verification purposes administrators will be asked to prove that they own the domain name associated with a Google Workspace account.","excerpt":"Accrues to the person or organization who registered the domain. For verification purposes administrators will be asked to prove that..","path":"\/glossary\/domain-ownership\/"},{"objectID":"391","title":"Domain Registration","content":"The process of registering Internet domain names with an accredited domain name registrar such as GoDaddy or eNom. Most registrars provide access to management of DNS records which is a requirement for use of Google Workspace.","excerpt":"The process of registering Internet domain names with an accredited domain name registrar such as GoDaddy or eNom. Most registrars..","path":"\/glossary\/domain-registration\/"},{"objectID":"393","title":"Dual delivery \/ multiple delivery","content":"Route messages to both a primary mail server and at least one additional, or secondary, mail server.","excerpt":"Route messages to both a primary mail server and at least one additional, or secondary, mail server.","path":"\/glossary\/dual-delivery-multiple-delivery\/"},{"objectID":"395","title":"Easy","content":"Without difficulty or effort.","excerpt":"Without difficulty or effort.","path":"\/glossary\/easy\/"},{"objectID":"397","title":"Email Routing","content":"A feature that provides more flexibility with messages addressed to your domain. You can enable email routing for your entire domain or certain user accounts. Google Workspace for Business and Education only.","excerpt":"A feature that provides more flexibility with messages addressed to your domain. You can enable email routing for your entire..","path":"\/glossary\/email-routing\/"},{"objectID":"399","title":"Email Migration","content":"A feature that helps domain administrators to transfer the existing contents of users' mailboxes from an outside source to Google Workspace. Server side tools are available for Google Workspace basic, Google Workspace business and Google Workspace for Education only.","excerpt":"A feature that helps domain administrators to transfer the existing contents of users' mailboxes from an outside source to Google..","path":"\/glossary\/email-migration\/"},{"objectID":"401","title":"Email Whitelist","content":"An email whitelist is a list of contacts that you deem are acceptable for sending mail to your domain and should not be labeled as spam. Google Workspace only.","excerpt":"An email whitelist is a list of contacts that you deem are acceptable for sending mail to your domain and..","path":"\/glossary\/email-whitelist\/"},{"objectID":"403","title":"Filters","content":"A Gmail feature that allows you to manage the flow of incoming messages automatically! Creating a filter consists of two steps, 1) Identify specific message criteria, and 2) Select specific actions to take based on that criteria.","excerpt":"A Gmail feature that allows you to manage the flow of incoming messages automatically! Creating a filter consists of two..","path":"\/glossary\/filters\/"},{"objectID":"405","title":"Full Header","content":"A full header contains information about the transfer of a message over the Internet. Typical message header fields include sender, recipient, subject, date, and server information.","excerpt":"A full header contains information about the transfer of a message over the Internet. Typical message header fields include sender,..","path":"\/glossary\/full-header\/"},{"objectID":"407","title":"Form","content":"You can create a form from the Docs list or from any spreadsheet.","excerpt":"You can create a form from the Docs list or from any spreadsheet.","path":"\/glossary\/form\/"},{"objectID":"409","title":"Google","content":"A verb that means \"to search on the Internet\". Larry Page and Sergey Brin, the founders of Google, named their search engine after the term googol. In 1997, Larry was brainstorming names with other Stanford graduate students, including Sean Anderson, and looking at available domain names. Anderson miskeyed googol as \"google\" and found it available. Larry liked it and the name \"Google\" stuck.","excerpt":"A verb that means \"to search on the Internet\". Larry Page and Sergey Brin, the founders of Google, named their..","path":"\/glossary\/google\/"},{"objectID":"411","title":"GooglePlex","content":"Google's corporate headquarters is called the GooglePlex, an affectionately tongue-in-cheek reference to the origins of the company name.","excerpt":"Google's corporate headquarters is called the GooglePlex, an affectionately tongue-in-cheek reference to the origins of the company name.","path":"\/glossary\/googleplex\/"},{"objectID":"413","title":"Google+","content":"Deprecated","excerpt":"Deprecated","path":"\/glossary\/google-2\/"},{"objectID":"415","title":"Google Account","content":"A free account that provides access to many Google products. You need a Google Account to sign up for Google Workspace. Google accounts require an email address. Any email address, including but not necessarily a Gmail address, will work.","excerpt":"A free account that provides access to many Google products. You need a Google Account to sign up for Google..","path":"\/glossary\/google-account\/"},{"objectID":"417","title":"Google App Engine","content":"Google's application development and hosting platform. It lets you build high traffic web applications without having to manage high traffic infrastructure.","excerpt":"Google's application development and hosting platform. It lets you build high traffic web applications without having to manage high traffic..","path":"\/glossary\/google-app-engine\/"},{"objectID":"419","title":"Google Apps (legacy free edition)","content":"Discontinued 12\/6\/2012.","excerpt":"Discontinued 12\/6\/2012.","path":"\/glossary\/google-apps-legacy-free-edition\/"},{"objectID":"423","title":"Google Certified Sales Specialist","content":"Trusted Google partners which have been authorized to help organizations adopt the Google Workspace web based tools, replacing existing legacy systems and IT infrastructure.","excerpt":"Trusted Google partners which have been authorized to help organizations adopt the Google Workspace web based tools, replacing existing legacy..","path":"\/glossary\/google-certified-sales-specialist\/"},{"objectID":"425","title":"Google Certified Deployment Specialist","content":"Trusted Google partners which have been authorized to help organizations adopt the Google Workspace web based tools, replacing existing legacy systems and IT infrastructure.","excerpt":"Trusted Google partners which have been authorized to help organizations adopt the Google Workspace web based tools, replacing existing legacy..","path":"\/glossary\/google-certified-deployment-specialist\/"},{"objectID":"429","title":"Business Standard","content":"A powerful edition of Google Workspace. A cloud based suite of email, calendar, instant message, voice, video and collaboration tools that increases business productivity better than any other solution. Formerly Google Workspace. Formerly Google Apps for Your Domain. Formerly Google Apps for Business. Formerly Google Apps for Work Unlimited Learn more.","excerpt":"A powerful edition of Google Workspace. A cloud based suite of email, calendar, instant message, voice, video and collaboration tools..","path":"\/glossary\/business-standard\/"},{"objectID":"431","title":"Google Workspace Migration","content":"The process of transferring email, contacts, documents, calendars, archives, etc. from a legacy system to Google Workspace.","excerpt":"The process of transferring email, contacts, documents, calendars, archives, etc. from a legacy system to Google Workspace.","path":"\/glossary\/google-workspace-migration\/"},{"objectID":"435","title":"Google Workspace Migration for Microsoft Outlook","content":"Complete migration of mail, calendars, and contacts from your Outlook account to Google Apps.","excerpt":"Complete migration of mail, calendars, and contacts from your Outlook account to Google Apps.","path":"\/glossary\/google-workspace-migration-for-microsoft-outlook\/"},{"objectID":"437","title":"Google Workspace Migration for Lotus Notes","content":"Complete migration of mail, calendars, contacts, and group information from your Notes accounts to Google Apps.","excerpt":"Complete migration of mail, calendars, contacts, and group information from your Notes accounts to Google Apps.","path":"\/glossary\/google-workspace-migration-for-lotus-notes\/"},{"objectID":"439","title":"Google Workspace Migration for Novell GroupWise","content":"Complete migration of mail, calendars, contacts, and group information from your GroupWise accounts to Google Apps.","excerpt":"Complete migration of mail, calendars, contacts, and group information from your GroupWise accounts to Google Apps.","path":"\/glossary\/google-workspace-migration-for-novell-groupwise\/"},{"objectID":"445","title":"Google Calendar","content":"A web-based calendar application that enables employees to work together efficiently and helps minimize costs and IT hassles.","excerpt":"A web-based calendar application that enables employees to work together efficiently and helps minimize costs and IT hassles.","path":"\/glossary\/google-calendar\/"},{"objectID":"447","title":"Google Docs","content":"Web-based documents, spreadsheets, drawings and presentations that let users edit the same file at the same time so you always have the latest version.","excerpt":"Web-based documents, spreadsheets, drawings and presentations that let users edit the same file at the same time so you always..","path":"\/glossary\/google-docs\/"},{"objectID":"449","title":"Google Gadgets","content":"Mini-applications that can be displayed on your personalised start page to show dynamic content. Examples: currency converter, translator, stock quotes, word of the day, or news feeds.","excerpt":"Mini-applications that can be displayed on your personalised start page to show dynamic content. Examples: currency converter, translator, stock quotes,..","path":"\/glossary\/google-gadgets\/"},{"objectID":"451","title":"Google Groups","content":"An administrative feature to manage team communications and sharing (formerly email lists). Learn more.","excerpt":"An administrative feature to manage team communications and sharing (formerly email lists). Learn more.","path":"\/glossary\/google-groups\/"},{"objectID":"453","title":"Google Hangout","content":"Rebranded to Google Chat and Google Meet and integrated into Google Workspace.","excerpt":"Rebranded to Google Chat and Google Meet and integrated into Google Workspace.","path":"\/glossary\/google-hangout\/"},{"objectID":"455","title":"Google Mail","content":"Also known as Gmail, is the core of Google Workspace. It's a free, advertising-supported email service provided by Google. Users may access Gmail as secure webmail,[1] as well via POP3 or IMAP protocols.[2][3] Gmail was launched as an invitation-only beta release on April 1, 2004[4] and it became available to the general public on February 7, 2007, though still in beta status at that time.[5] The service was upgraded from beta status on July 7, 2009, along with the rest of the Google Workspace.[6][7] With an initial storage capacity offer of 1 GB per user, Gmail significantly increased the webmail standard for free storage from the 2 to 4 MBits competitors such as Hotmail offered at that time.[8] Individual Gmail messages, including attachments, may be up to 25 MB,[9] which is larger than many other mail services support. Gmail has a search-oriented interface and a \"conversation view\" similar to an Internet forum. Gmail is noted by web developers for its pioneering use of AJAX.[10] Gmail runs on Google GFE\/2.0 on Linux.[11][12][13]","excerpt":"Also known as Gmail, is the core of Google Workspace. It's a free, advertising-supported email service provided by Google. Users..","path":"\/glossary\/google-mail\/"},{"objectID":"457","title":"Google Plus","content":"See Google+","excerpt":"See Google+","path":"\/glossary\/google-plus\/"},{"objectID":"459","title":"Google Sites","content":"Google Sites is an easy way to create secure web pages for intranets and team projects. No coding or HTML required.","excerpt":"Google Sites is an easy way to create secure web pages for intranets and team projects. No coding or HTML..","path":"\/glossary\/google-sites\/"},{"objectID":"461","title":"Google Talk Client","content":"Google Talk is a downloadable Windows application that enables users to quickly and easily chat, voice call, and file transfer for free. Calls are made through your computer using the latest voice technology; all you need is an Internet connection, a microphone and a speaker.","excerpt":"Google Talk is a downloadable Windows application that enables users to quickly and easily chat, voice call, and file transfer..","path":"\/glossary\/google-talk-client\/"},{"objectID":"463","title":"Google Video for Business","content":"A video hosting and sharing solution for enterprises.","excerpt":"A video hosting and sharing solution for enterprises.","path":"\/glossary\/google-video-for-business\/"},{"objectID":"465","title":"Google Voice and Voice and Video Chat Plugin","content":"Required to use Google Hangouts features and is loaded by Chrome automatically.","excerpt":"Required to use Google Hangouts features and is loaded by Chrome automatically.","path":"\/glossary\/google-voice-and-voice-and-video-chat-plugin\/"},{"objectID":"467","title":"Googol","content":"A googol is a very large number; the digit 1 followed by one hundred zeros. The term was coined in 1938 by 9-year-old Milton Sirotta (1929–1981), nephew of American mathematician Edward Kasner. Kasner popularized the concept in his book Mathematics and the Imagination (1940).","excerpt":"A googol is a very large number; the digit 1 followed by one hundred zeros. The term was coined in..","path":"\/glossary\/googol\/"},{"objectID":"469","title":"Googolplex","content":"Another mathematician devised the term googolplex for 10 to the power of googol - that is, 1 followed by 10 to the power of 100 zeros. Frank Pilhofer has determined that, given Moore's Law (which is that computer processor power doubles about every 1 to 2 years), it would make no sense to try to print out a googolplex until the year 2530 since all earlier attempts to print a googolplex would be overtaken by a faster computer processor.","excerpt":"Another mathematician devised the term googolplex for 10 to the power of googol - that is, 1 followed by 10..","path":"\/glossary\/googolplex\/"},{"objectID":"471","title":"Hangouts","content":"Deprecated - Google+ Hangouts is a communication service that replaced Google Talk, Chat in Gmail, and Google+ Messenger to create a better experience to send messages, photos and make group video calls. Hangouts is available in Gmail, Google+, on iOS or Android device, and as a Chrome extension. Hangouts is turned OFF by default for Google Workspace. Domain admins must opt-in via the admin console. After opting in, Admins can choose to opt out for the domain or for organizational units within it whenever they want. IMPORTANT: Domains that have opted-in to Google+ Hangouts cannot purchase Google Workspace Vault and you should not opt in if you plan to purchase Vault. Domains that have purchased Vault or are under data location restrictions will not be able to opt-in.","excerpt":"Deprecated - Google+ Hangouts is a communication service that replaced Google Talk, Chat in Gmail, and Google+ Messenger to create..","path":"\/glossary\/hangouts\/"},{"objectID":"473","title":"Headers","content":"See full header.","excerpt":"See full header.","path":"\/glossary\/headers\/"},{"objectID":"475","title":"Host","content":"To store (a website or other data) on a server or other computer so that it can be accessed over the Internet.","excerpt":"To store (a website or other data) on a server or other computer so that it can be accessed over the..","path":"\/glossary\/host\/"},{"objectID":"477","title":"Instant Messaging","content":"Instant messaging or IM is a form of real-time text communication. See chat.","excerpt":"Instant messaging or IM is a form of real-time text communication. See chat.","path":"\/glossary\/instant-messaging\/"},{"objectID":"479","title":"IMAP","content":"Is an acronym for \"Internet Message Access Protocol\". It is one of the two most prevalent Internet standard protocols for e-mail retrieval, the other being the Post Office Protocol (POP). Virtually all modern e-mail clients and e-mail servers support both protocols as a means of transferring e-mail messages from a server.","excerpt":"Is an acronym for \"Internet Message Access Protocol\". It is one of the two most prevalent Internet standard protocols for..","path":"\/glossary\/imap\/"},{"objectID":"481","title":"IP Address","content":"IP is an acronym for \"Internet Protocol\". IP addresses are unique numbers that allow devices to locate information on a network. See Basic Guide to DNS","excerpt":"IP is an acronym for \"Internet Protocol\". IP addresses are unique numbers that allow devices to locate information on a..","path":"\/glossary\/ip-address\/"},{"objectID":"483","title":"Labels","content":"Labels are a Gmail feature that enables you to identify and find your messages. Labels are similar to folders but better: you can add more than one Label to an email message or email conversation. Messages that have a Label may be Archived or may remain in your inbox. Once you've created a Label, you may view all messages with that Label by clicking the Label name along the left side of any Gmail window.","excerpt":"Labels are a Gmail feature that enables you to identify and find your messages. Labels are similar to folders but..","path":"\/glossary\/labels\/"},{"objectID":"485","title":"Labs","content":"Are a collection of new features that add functionality to your Gmail account. Google's continuous innovations are presented as labs, and mature lab features eventually graduate to be incorporated into Gmail's core service.","excerpt":"Are a collection of new features that add functionality to your Gmail account. Google's continuous innovations are presented as labs,..","path":"\/glossary\/labs\/"},{"objectID":"487","title":"Locked Content","content":"Admins can lock the left column content of start pages with important information. Users will not be able to move or edit these areas. This feature won't be available in the accounts created after November 19th, 2007.","excerpt":"Admins can lock the left column content of start pages with important information. Users will not be able to move..","path":"\/glossary\/locked-content\/"},{"objectID":"489","title":"Mail Delegation","content":"If this option is enabled, users can grant one another access to their e-mail accounts. That access permits specified users to read messages in that account, and to send messages on behalf of that account. Delegation is useful when someone wants to provide access to an assistant while away on vacation.","excerpt":"If this option is enabled, users can grant one another access to their e-mail accounts. That access permits specified users..","path":"\/glossary\/mail-delegation\/"},{"objectID":"491","title":"MX Record","content":"Mail Exchange (MX) records direct email to servers for a domain. Multiple MX records can be defined for a domain, each with a different priority where the lowest number is the highest priority. If mail can't be delivered using the first priority record, the second priority record is used, and so on. To set up email with Google Workspace, you need to point your MX records to Google's mail servers.","excerpt":"Mail Exchange (MX) records direct email to servers for a domain. Multiple MX records can be defined for a domain,..","path":"\/glossary\/mx-record\/"},{"objectID":"493","title":"Message Security and Discovery","content":"This is the old name for Message Security for Google Workspace.","excerpt":"This is the old name for Message Security for Google Workspace.","path":"\/glossary\/message-security-and-discovery\/"},{"objectID":"495","title":"Message Security for Google Workspace","content":"This service allows administrators to have more granular control over spam, virus, and message filtering. This service is available in Google Workspace Basic, Google Workspace Business, and Google Workspace Education. For more information, see Message Security for Google Workspace in the Help Center.","excerpt":"This service allows administrators to have more granular control over spam, virus, and message filtering. This service is available in..","path":"\/glossary\/message-security-for-google-workspace\/"},{"objectID":"497","title":"Nicknames","content":"A nickname is a user's alternate email address. A nickname is not a username, and it is not a separate email account.","excerpt":"A nickname is a user's alternate email address. A nickname is not a username, and it is not a separate..","path":"\/glossary\/nicknames\/"},{"objectID":"513","title":"Privileges","content":"Refers to administration rights of an administrator to manage Google Workspace services for a domain.","excerpt":"Refers to administration rights of an administrator to manage Google Workspace services for a domain.","path":"\/glossary\/privileges\/"},{"objectID":"515","title":"Provisioned User","content":"A user account that has been created in the Google Workspace admin console or via Google Workspace Directory Sync.","excerpt":"A user account that has been created in the Google Workspace admin console or via Google Workspace Directory Sync.","path":"\/glossary\/provisioned-user\/"},{"objectID":"519","title":"Rapid release track","content":"Google Workspace users receive new features and updates automatically, without needing to install or update software, however you can still control when new features become available for users. The rapid release track allows users to access new features as soon as Google rolls them out to consumer users. These features have been through testing and quality assurance, but users will see them at the same time administrators do, before administrators have a chance to evaluate them for their organization.","excerpt":"Google Workspace users receive new features and updates automatically, without needing to install or update software, however you can still..","path":"\/glossary\/rapid-release-track\/"},{"objectID":"499","title":"NS Record","content":"Name server (NS) records determine which servers will hold and communicate DNS information for a domain. Generally, you should have primary and secondary name server records for your domain. If using Google Workspace, you may configure NS records with your registrar or domain hosting service that point to Google servers for DNS queries.","excerpt":"Name server (NS) records determine which servers will hold and communicate DNS information for a domain. Generally, you should have..","path":"\/glossary\/ns-record\/"},{"objectID":"501","title":"Offline Gmail","content":"Gmail Offline beta is a Gmail app built to support offline access, allowing mail to be read, responded to, searched and archived without network access. After first start-up, Gmail Offline will automatically synchronize messages and queued actions anytime Chrome is running and an Internet connection is available. More than just an offline app, the streamlined user interface, based off Gmail’s popular tablet interface, provides extremely fast response time with a pure, email focused experience.","excerpt":"Gmail Offline beta is a Gmail app built to support offline access, allowing mail to be read, responded to, searched..","path":"\/glossary\/offline-gmail\/"},{"objectID":"503","title":"Policy Management and Message Recovery","content":"This is a legacy service originally provided by Postini to Google Workspace customers. This was made available only to customers who registered for Google Workspace before August 28, 2008. \"Message Security for Google Workspace\" is the new name.","excerpt":"This is a legacy service originally provided by Postini to Google Workspace customers. This was made available only to customers..","path":"\/glossary\/policy-management-and-message-recovery\/"},{"objectID":"505","title":"POP","content":"An acronym for \"Post Office Protocol\". An application-layer Internet standard protocol used by local e-mail clients to retrieve e-mail from a remote server over a TCP\/IP connection. POP and IMAP (Internet Message Access Protocol) are the two most prevalent Internet standard protocols for e-mail retrieval. Virtually all modern e-mail clients and servers support both. The POP protocol has been developed through several versions, with version 3 (POP3) being the current standard. Like IMAP, POP3 is supported by most webmail services such as Hotmail, Gmail and Yahoo! Mail.","excerpt":"An acronym for \"Post Office Protocol\". An application-layer Internet standard protocol used by local e-mail clients to retrieve e-mail from..","path":"\/glossary\/pop\/"},{"objectID":"507","title":"Postini","content":"An email, web security and archiving Company Google bought in 2007. It provided cloud computing services for filtering out spam and malware prior to message delivery, and offered optional e-mail archiving. Most of Postini's features are now offered natively in Google Workspace, and Google stopped offering Postini in 2012.","excerpt":"An email, web security and archiving Company Google bought in 2007. It provided cloud computing services for filtering out spam..","path":"\/glossary\/postini\/"},{"objectID":"509","title":"Primary Domain","content":"Refers to the primary domain of your Google Workspace account. You can add domain aliases to your primary domain.","excerpt":"Refers to the primary domain of your Google Workspace account. You can add domain aliases to your primary domain.","path":"\/glossary\/primary-domain\/"},{"objectID":"511","title":"Priority Inbox","content":"Priority Inbox can help save you time if you’re overwhelmed with the amount of email you get. It attempts to automatically identify your important incoming messages and separates them from everything else. Gmail uses a variety of signals to prioritize your incoming messages, including who you’ve emailed and chatted with most and which keywords appear frequently in the messages you opened recently. Learn more.","excerpt":"Priority Inbox can help save you time if you’re overwhelmed with the amount of email you get. It attempts to..","path":"\/glossary\/priority-inbox\/"},{"objectID":"521","title":"SaaS","content":"Is an acronym for \"software as a service\". SaaS is a software distribution model in which software applications are hosted by a vendor or service provider and made available to customers over a network. It's software delivered on a pay-as-you-go basis as a utility (like electricity) over a network (typically the Internet).","excerpt":"Is an acronym for \"software as a service\". SaaS is a software distribution model in which software applications are hosted by..","path":"\/glossary\/saas\/"},{"objectID":"523","title":"Scheduled release track","content":"Google Workspace users receive new features and updates automatically, without needing to install or update software, however you can still control when new features become available for users. The scheduled release track delays the release of new features to users, giving administrators extra time to train support staff and prepare users for the coming changes. Google releases features to the scheduled release track on Tuesdays only, at least one week after the feature was released to the rapid release track.","excerpt":"Google Workspace users receive new features and updates automatically, without needing to install or update software, however you can still..","path":"\/glossary\/scheduled-release-track\/"},{"objectID":"525","title":"Single Sign-on API","content":"SAML-based Single Sign-On (SSO) provides full control over the authorization and authentication of user accounts that access web based applications (like GMail or Calendar). Available to Google Workspace only.","excerpt":"SAML-based Single Sign-On (SSO) provides full control over the authorization and authentication of user accounts that access web based applications..","path":"\/glossary\/single-sign-on-api\/"},{"objectID":"527","title":"Sites","content":"An online application offered by Google Workspace that makes creating a team web site as easy as editing a document. Learn more.","excerpt":"An online application offered by Google Workspace that makes creating a team web site as easy as editing a document. Learn..","path":"\/glossary\/sites\/"},{"objectID":"529","title":"Smart hosting","content":"Route outbound mail to an outbound mail gateway, which then delivers messages to the recipients.","excerpt":"Route outbound mail to an outbound mail gateway, which then delivers messages to the recipients.","path":"\/glossary\/smart-hosting\/"},{"objectID":"531","title":"SMTP","content":"Is an acronym for \"Simple Mail Transfer Protocol\". It is an Internet standard for electronic mail (e-mail) transmission across Internet Protocol (IP) networks.","excerpt":"Is an acronym for \"Simple Mail Transfer Protocol\". It is an Internet standard for electronic mail (e-mail) transmission across Internet..","path":"\/glossary\/smtp\/"},{"objectID":"533","title":"SOA","content":"Is an acronym for \"Start of Authority\". Domain registration establishes SOA records in the DNS servers of the parent domain, indicating the IP address of authoritative DNS servers.","excerpt":"Is an acronym for \"Start of Authority\". Domain registration establishes SOA records in the DNS servers of the parent domain,..","path":"\/glossary\/soa\/"},{"objectID":"535","title":"SPF","content":"Is an acronym for \"Sender Policy Framework\". It's an open standard specifying a technical method to prevent sender address forgery.","excerpt":"Is an acronym for \"Sender Policy Framework\". It's an open standard specifying a technical method to prevent sender address forgery.","path":"\/glossary\/spf\/"},{"objectID":"537","title":"Split delivery","content":"If you have unregistered Google Workspace users, you can route those users to an on-premise mail server. You can also set up split delivery for registered users in different organizational units.","excerpt":"If you have unregistered Google Workspace users, you can route those users to an on-premise mail server. You can also..","path":"\/glossary\/split-delivery\/"},{"objectID":"539","title":"SSL","content":"Is an acronym for \"Secure Sockets Layer\". It's a cryptographic protocol that provides communication security over the Internet.","excerpt":"Is an acronym for \"Secure Sockets Layer\". It's a cryptographic protocol that provides communication security over the Internet.","path":"\/glossary\/ssl\/"},{"objectID":"545","title":"Subdomain","content":"A subdomain is a part of a larger domain. For example, www.EasygCloud.com is a subdomain of http:\/\/EasygCloud.com.","excerpt":"A subdomain is a part of a larger domain. For example, www.EasygCloud.com is a subdomain of http:\/\/EasygCloud.com.","path":"\/glossary\/subdomain\/"},{"objectID":"547","title":"Super Administrator Account","content":"A super administrator has complete access to the Google Workspace administrator console, and can assign administrators with restricted access to specific sections of the admin console. See Administrator privileges for details about which administrator actions are available from each admin console section.","excerpt":"A super administrator has complete access to the Google Workspace administrator console, and can assign administrators with restricted access to..","path":"\/glossary\/super-administrator-account\/"},{"objectID":"549","title":"Temporary E-mail Address","content":"Assigned to all user accounts once domain ownership has been verified. This allows you to test sending and receiving mail before changing your domain's MX records.","excerpt":"Assigned to all user accounts once domain ownership has been verified. This allows you to test sending and receiving mail..","path":"\/glossary\/temporary-e-mail-address\/"},{"objectID":"551","title":"Templates","content":"A number of templates available for docs in our template gallery.","excerpt":"A number of templates available for docs in our template gallery.","path":"\/glossary\/templates\/"},{"objectID":"553","title":"TLS","content":"Is an acronym for \"Transport Layer Security\". TLS and its predecessor, Secure Sockets Layer (SSL), are cryptographic protocols that provide communication security over the Internet.","excerpt":"Is an acronym for \"Transport Layer Security\". TLS and its predecessor, Secure Sockets Layer (SSL), are cryptographic protocols that provide..","path":"\/glossary\/tls\/"},{"objectID":"555","title":"TLS compliance routing","content":"Require an encrypted connection when corresponding with specific domains or recipients.","excerpt":"Require an encrypted connection when corresponding with specific domains or recipients.","path":"\/glossary\/tls-compliance-routing\/"},{"objectID":"557","title":"Transfer Token","content":"A special token (https:\/\/admin.google.com\/TransferToken) which allows you to transfer the management of your Google Workspace account to a new Google Cloud Partner. Log in to your account prior to generating the token. Once you authenticate with a valid super administrator username and password, a token is generated. Give the token's alphanumeric code to your new Google Partner, which completes the transfer. There is no charge for transfers, however your Company may remain liable to pay Google for the remaining balance of your contract, depending on who you speak with at Google.","excerpt":"A special token (https:\/\/admin.google.com\/TransferToken) which allows you to transfer the management of your Google Workspace account to a new Google..","path":"\/glossary\/transfer-token\/"},{"objectID":"559","title":"TXT Record","content":"Text or TXT records may contain arbitrary text but can also be used to define machine readable text. TXT records are used primarily with Google Workspace for domain ownership verification purposes. Also, you’ll need to use TXT records to implement email abuse prevention methods such as SPF, DKIM, and DMARC.","excerpt":"Text or TXT records may contain arbitrary text but can also be used to define machine readable text. TXT records..","path":"\/glossary\/txt-record\/"},{"objectID":"561","title":"URL","content":"Is an acronym for \"Uniform Resource Locator\". This is the address of a resource on the Internet. For example, the URL of this page is http:\/\/easygcloud.com\/glossary.","excerpt":"Is an acronym for \"Uniform Resource Locator\". This is the address of a resource on the Internet. For example, the..","path":"\/glossary\/url\/"},{"objectID":"563","title":"User-customizable Columns","content":"Unlocked modules of the start page where users to add content, such as Google Gadgets.","excerpt":"Unlocked modules of the start page where users to add content, such as Google Gadgets.","path":"\/glossary\/user-customizable-columns\/"},{"objectID":"565","title":"Username","content":"A username is the name a user enters when logging in to Google Workspace services. A user's email address is his or her username followed by @domain.com.","excerpt":"A username is the name a user enters when logging in to Google Workspace services. A user's email address is..","path":"\/glossary\/username\/"},{"objectID":"567","title":"User E-mail Uploads","content":"Users can migrate e-mail from their old accounts into Google Workspace e-mail using the Email Migration API. If administrators prefer to manage the email migration for their domain, they can disable this feature in the admin console.","excerpt":"Users can migrate e-mail from their old accounts into Google Workspace e-mail using the Email Migration API. If administrators prefer..","path":"\/glossary\/user-e-mail-uploads\/"},{"objectID":"569","title":"Video","content":"See Google Video for business.","excerpt":"See Google Video for business.","path":"\/glossary\/video\/"},{"objectID":"571","title":"Warning Message","content":"To protect information that's critical to your organization, you can enable a warning message each time a user communicates or shares information via calendar, documents &amp; spreadsheets, and chat.","excerpt":"To protect information that's critical to your organization, you can enable a warning message each time a user communicates or..","path":"\/glossary\/warning-message\/"},{"objectID":"573","title":"Web Publishing Address","content":"URL for your web pages.","excerpt":"URL for your web pages.","path":"\/glossary\/web-publishing-address\/"},{"objectID":"575","title":"WHOIS","content":"A public listing of domain names, and people or organizations associated with each domain name. See Basic Guide to DNS","excerpt":"A public listing of domain names, and people or organizations associated with each domain name. See Basic Guide to DNS","path":"\/glossary\/whois\/"}]