[{"objectID":"195","title":"Your Work, Made Easier","content":"Your Work, Made Easier\nIf you could improve security, teamwork, performance and cost all at once, would you do it? It’s true! We can help you improve your business with Google’s easy to learn, easy to use business software. Get a tightly integrated solution for your Company that's secure, reliable, easy to use, powerful and includes 24\/365 support by Google. Don't let technology impede your business!\n\nGET STARTEDLEARN MORE\n\n\n\nWork smarter with best practices as a service and optional management by a Certified Google Cloud Partner.","excerpt":"Your Work, Made Easier If you could improve security, teamwork, performance and cost all at once, would you do it?..","path":"\/"},{"objectID":"669","title":"Support","content":"Support","excerpt":"Support","path":"\/support\/"},{"objectID":"666","title":"Licenses","content":"Licenses","excerpt":"Licenses","path":"\/licenses\/"},{"objectID":"192","title":"Talk with an expert","content":"Talk with an expert","excerpt":"Talk with an expert","path":"\/contact\/"},{"objectID":"272","title":"Why Use easyG?","content":"Why Use easyG?\nGoogle Workspace has been our primary business tool since 2006. easyg Cloud has been a Google Cloud Partner since 2011.","excerpt":"Why Use easyG? Google Workspace has been our primary business tool since 2006. easyg Cloud has been a Google Cloud..","path":"\/why\/"},{"objectID":"183","title":"Services","content":"Services\nGoogle Workspace has been our primary business tool since 2006. easyG cloud has been a Google Cloud Partner since 2011","excerpt":"Services Google Workspace has been our primary business tool since 2006. easyG cloud has been a Google Cloud Partner since..","path":"\/services\/"},{"objectID":"708","title":"Recent Posts","content":"Recent Posts        \n                \n                    \n                 \n  \n    \n      \n      \n      \n      \n\t\tMay 20, 2023\t  \n      \n\t\n  \n\tTime &#038; project management in Google Docs\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tImprove time management and display time with new chips in Google Docs In addition to the recent introduction of new smart canvas features in Google Sheets and Google Docs, we’re adding new timer chips that can be used to timebox activities and ensure that you’re using your time productively.\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 20, 2020\t  \n      \n\t\n  \n\tAnnouncing Google Workspace\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tJune 20, 2019\t  \n      \n\t\n  \n\tGoogle Voice\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tGoogle Voice If your work days are filled with email, text, voice, messenger, chat &amp; tweets, you know more channels make it harder to stay connected &amp; organized. There are more phone numbers than people in the world, so voice communication is still the most universal way to connect. Combining communication channels is a great way to [&hellip;]\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tMarch 15, 2019\t  \n      \n\t\n  \n\tReduce repetition with a typing accelerator\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tIf you type a lot, you may be repeating certain phrases frequently. Why not standardize those phrases and create short cuts to save time? There are multiple options to do just that, but the best one we've found for Google Chrome is Text Blaze. If you like it, it can be used individually or by [&hellip;]\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tDecember 27, 2018\t  \n      \n\t\n  \n\tEmail subject lines are like news headlines\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tEmail Tip: Always include a subject line. Time spent in an email inbox can be stressful, and some people have a tendency to rush. Your subject line competes against many others for their attention\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 9, 2018\t  \n      \n\t\n  \n\tGet Google sign-in prompts on all of your phones\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tInstead of using a 2-Step Verification code to sign in to your G Suite account, you can tap a prompt that Google sends to your phone. This prompt is an easier and even more secure way of authenticating your account, and it respects mobile policies enforced on G Suite employee devices.\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tAugust 28, 2018\t  \n      \n\t\n  \n\tGet notified of Gmail message rejections\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tAs an administrator, would you like to be notified if Gmail rejects over 24 messages to a single recipient within one hour?\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tFebruary 28, 2018\t  \n      \n\t\n  \n\tHangouts to be replaced by Google Meet and Google Chat\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tWhether you love it or hate it, Google Hangouts has helped millions of people connect better. Last year, Google Meet was released and today, Google Chat is going live.\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tAugust 21, 2017\t  \n      \n\t\n  \n\tMap your site to a custom URL in the new Google Sites\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tThe classic Google Sites allowed web address mapping. When the new Google Sites launched, this feature was not available. Until now:\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tApril 27, 2017\t  \n      \n\t\n  \n\tGoogle Storage Options\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tWhat kind of Google storage are you using for Gmail, Google Drive, and Google Photos? If you're using Google for a business, the answer matters! G Suite (Basic, Business, and Enterprise) customers might not realize that there are two different kinds of storage available. Either way, Google definitely does not own your data.\n\t\n\n\tRead More\n\n            \n                        \n                1\n2\n3\n&hellip;\n10\nNext &raquo;","excerpt":"Recent Posts May 20, 2023 Time &#038; project management in Google Docs easyG Improve time management and display time with..","path":"\/blog\/"},{"objectID":"598","title":"FAQs","content":"FAQs\n\n\n\nI want to sign up for Google Workspace with my own domain name. Is this possible?Absolutely. If you already have a company domain name, or need to create a new one, Google Workspace can meet your needs. Each user at your domain will get a Workspace account branded with your own domain name. Email addresses take the format 'username@yourdomain.com.'\n\n\n\nDoes Google host websites too?Google Sites is designed to make it easy for your team to create and collaborate on internal sites for their projects and departments. You can make Google Sites public, but most organizations prefer specialized website development and hosting platforms for their public sites.\nIf you're looking for modern website solutions for your public web site, you may want to consider jamstack or static website solutions. We can help!","excerpt":"FAQs I want to sign up for Google Workspace with my own domain name. Is this possible?Absolutely. If you already..","path":"\/faq\/"},{"objectID":"309","title":"Glossary","content":"Glossary\n\n\n\n.CSVIs an acronym for \"Comma-Separated Value\" and a file format. This file format represents tabular data in text form. Rows are represented by new lines and cells are separated by commas.\n\n\nA RecordAddress or A records (also known as host records) are the central records of DNS. These records link a domain to an IP address. You need A records if you want to forward your naked domain in Google Workspace.\n\n\nAbuseAbuse is a reserved username and Google monitors abuse@yourdomain.com.\n\n\nAccount TypeRefers to an edition; Legacy Google Workspace, Google Workspace,&nbsp;Google Workspace for Education or Google Workspace for Government.\n\n\nAdmin consoleThis is the web based tool administrators may use to manage Google Workspace, Android and Chrome devices, and other Enterprise products and services. Learn more about the admin console with this video.\n\n\n\nAdministrator AccountThis account is used to manage the domain, create user accounts, publish web pages, customize URLs and your domain's start page, and much more. The user(s) who have access to these accounts are called an administrator or admin. There are multiple permissions levels for administrator accounts with the highest level being called the \"Super Administrator\". \n\n\nAliasSee Domain Alias.\n\n\nAPIAPI is an acronym for \"Application Program Interface\". There are several Google Workspace administrative APIs.\n\n\nArchiveArchive is a Gmail feature that removes the Inbox label from a message, letting you clean up your inbox without deleting anything. It's a good idea to archive [rather than delete] messages you may wish to refer to some day. All archived messages can be found in several different ways: in the All Mail label, in any labels you've applied to them, and in Gmail's search results. When someone replies to a message you've archived, the conversation containing that message will reappear in your inbox. In legacy applications, archiving your email stores messages where they're no longer accessible.\n\n\nAttachment routing\nSee content routing.\n\n                    \n                                            \n                                        \n                        \n                            1\n2\n3\n&hellip;\n14\nNext &raquo;","excerpt":"Glossary .CSVIs an acronym for \"Comma-Separated Value\" and a file format. This file format represents tabular data in text form...","path":"\/glossary-terms\/"},{"objectID":"708","title":"May 20, 2023","content":"May 20, 2023\nTime &#038; project management in Google Docs","excerpt":"May 20, 2023 Time &#038; project management in Google Docs","path":"\/uncategorized\/time-project-management-in-google-docs\/"},{"objectID":"133","title":"October 20, 2020","content":"October 20, 2020\nAnnouncing Google Workspace","excerpt":"October 20, 2020 Announcing Google Workspace","path":"\/blog\/announcing-google-workspace\/"},{"objectID":"132","title":"June 20, 2019","content":"June 20, 2019\nGoogle Voice","excerpt":"June 20, 2019 Google Voice","path":"\/video\/google-voice-by-g-suite\/"},{"objectID":"130","title":"March 15, 2019","content":"March 15, 2019\nReduce repetition with a typing accelerator","excerpt":"March 15, 2019 Reduce repetition with a typing accelerator","path":"\/blog\/reduce-typing\/"},{"objectID":"129","title":"December 27, 2018","content":"December 27, 2018\nEmail subject lines are like news headlines","excerpt":"December 27, 2018 Email subject lines are like news headlines","path":"\/blog\/email-subject-lines-are-like-news-headlines\/"},{"objectID":"128","title":"October 9, 2018","content":"October 9, 2018\nGet Google sign-in prompts on all of your phones","excerpt":"October 9, 2018 Get Google sign-in prompts on all of your phones","path":"\/blog\/get-google-sign-in-prompts-on-all-of-your-phones\/"},{"objectID":"127","title":"August 28, 2018","content":"August 28, 2018\nGet notified of Gmail message rejections","excerpt":"August 28, 2018 Get notified of Gmail message rejections","path":"\/blog\/get-notified-of-gmail-message-rejections\/"},{"objectID":"126","title":"February 28, 2018","content":"February 28, 2018\nHangouts to be replaced by Google Meet and Google Chat","excerpt":"February 28, 2018 Hangouts to be replaced by Google Meet and Google Chat","path":"\/blog\/hangouts-to-be-replaced-by-google-meet-and-google-chat\/"},{"objectID":"125","title":"August 21, 2017","content":"August 21, 2017\nMap your site to a custom URL in the new Google Sites","excerpt":"August 21, 2017 Map your site to a custom URL in the new Google Sites","path":"\/blog\/map-your-site-to-a-custom-url-in-the-new-google-sites\/"},{"objectID":"124","title":"April 27, 2017","content":"April 27, 2017\nGoogle Storage Options","excerpt":"April 27, 2017 Google Storage Options","path":"\/blog\/google-storage-options\/"},{"objectID":"123","title":"Recent Posts","content":"Recent Posts        \n                \n                    \n                 \n  \n    \n      \n      \n      \n      \n\t\tApril 18, 2017\t  \n      \n\t\n  \n\tMeet the new Hangouts\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tHangouts Meet is Google's new video meeting experience that makes joining meetings effortless. It helps people be as productive as they are when they’re face-to-face. If you're already using G Suite Basic or G Suite Business, you already have access to this new service\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tApril 18, 2017\t  \n      \n\t\n  \n\tCheck out Google Workspace\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tMarch 28, 2017\t  \n      \n\t\n  \n\tNew Calendar administrator privileges available in the Admin console\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tAdministration of your Organization's Calendars just got more powerful. Now you can delegate control of the Calendar Resources section and the Calendar Settings section of the&nbsp;Admin Console via a new predefined administrator role just for calendars. Learn more\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tFebruary 28, 2017\t  \n      \n\t\n  \n\tGoogle Keep has become a Google Workspace core service\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tGoogle Keep has been around since 2013, and today, Keep has become a G Suite core service with Admin console controls and access in Google Docs\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tDecember 30, 2016\t  \n      \n\t\n  \n\tAction items are better than attachments\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tEmployees spend about 20% of their time at work searching for information. Make teamwork easier with Google files by assigning action items to people instead of sending attachments.\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tJanuary 5, 2016\t  \n      \n\t\n  \n\tReminders in Google Calendar\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tOne of the weak points in Google Apps has always been the task list (also known as a to-do list). Google has finally improved on it's antiquated task list with it's new \"Reminders\", which are integrated with Calendar in a way that's a pleasure to use.\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tNovember 13, 2015\t  \n      \n\t\n  \n\tGmail and Inbox by Google\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tWe love Gmail, but Google is working on it's replacement, called \"Inbox\". If you would like to try it out, consider using both apps in parallel. You may use Gmail on desktop and Inbox on mobile for the best of both worlds.\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 11, 2015\t  \n      \n\t\n  \n\tProject Management in Google Apps\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tA project is any outcome that requires more than one action step. Most teams need project management. If your team is using Google Apps, Google Sites may be used as a simple project management tool.\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tSeptember 10, 2015\t  \n      \n\t\n  \n\tTransform your work with Google\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tTransform the way you work with Google. These templates will help you use Google for some of your most basic business processes.\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tAugust 27, 2015\t  \n      \n\t\n  \n\tCreate a new Google Doc quickly\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tIf you create a lot of Google Docs, you may want to streamline that process. Here's a simple link for creating a new Doc:\n\t\n\n\tRead More\n\n            \n                        \n                &laquo; Previous\n1\n2\n3\n4\n&hellip;\n10\nNext &raquo;","excerpt":"Recent Posts April 18, 2017 Meet the new Hangouts easyG Hangouts Meet is Google's new video meeting experience that makes..","path":"\/blog\/page\/2\/"},{"objectID":"111","title":"Recent Posts","content":"Recent Posts        \n                \n                    \n                 \n  \n    \n      \n      \n      \n      \n\t\tAugust 18, 2015\t  \n      \n\t\n  \n\tFinally, an easy to use router!\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tFinally there's a router that's easy to use!\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tJuly 28, 2015\t  \n      \n\t\n  \n\tGoogle Apps Update Alerts\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tReverse sort and instantly edit with your favorite apps in the new Google Drive for Android app Posted:2016-03-21 09:37:13 UTC-07:00 A new version of the Google Drive for Android app is available in Google Play. New features include: Reverse Sort:&nbsp;We’ve heard feedback that you want more flexibility in how files are sorted. We’re adding the [&hellip;]\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tMay 17, 2015\t  \n      \n\t\n  \n\tGetting things done\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tIf you want to get things done, you will probably want a to do list. Over the years we've tried many,\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tMarch 5, 2015\t  \n      \n\t\n  \n\tAndroid for Work\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tThe latest news for BYOD (Bring Your Own Device) is yet another Google SKU, Android for Work. It includes a new App Store with a funny name \"Google Play for Work\":\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tMarch 1, 2015\t  \n      \n\t\n  \n\tWork faster with keyboard shortcuts\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tMost people keep their hand on their mouse while working on their PC, but there's a better way. With keyboard shortcuts, you may get more work done in less time. It may not seem like reaching for your mouse takes much time, but it adds up.\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tFebruary 9, 2015\t  \n      \n\t\n  \n\tGoogle versus Microsoft\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tThe tipping point is coming. As more and more businesses migrate from Microsoft Office to Google for Work, the trend is increasing.\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tFebruary 2, 2015\t  \n      \n\t\n  \n\tGoogle Meet Training Lessons\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tNew! Interactive Audiovisual Google Hangouts Training Lessons We now offer a full suite of Google Hangouts training lessons which cover topics ranging from text chat to video meetings to creating conference calls. The training is accessible within the English Gmail interface. Additional languages will become available in the coming months. Here is a full list [&hellip;]\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tJanuary 30, 2015\t  \n      \n\t\n  \n\tGoogle Now becomes more useful\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tGoogle now is becoming more useful. New Apps are being added for additional notifications\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tJanuary 9, 2015\t  \n      \n\t\n  \n\tGreat way to improve your business\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tA great way to improve your business is to get feedback from your customers. One easy way to do that is with reviews on Google+. To generate reviews from your customers, ask them to follow these simple instructions!\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tNovember 25, 2014\t  \n      \n\t\n  \n\tImprove online security\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tA new Devices and Activity dashboard&nbsp;gives your users additional insight over the devices accessing their Google account. It shows all the devices that have been active on an account in the last 28 days.\n\t\n\n\tRead More\n\n            \n                        \n                &laquo; Previous\n1\n2\n3\n4\n5\n&hellip;\n10\nNext &raquo;","excerpt":"Recent Posts August 18, 2015 Finally, an easy to use router! easyG Finally there's a router that's easy to use!..","path":"\/blog\/page\/3\/"},{"objectID":"97","title":"Recent Posts","content":"Recent Posts        \n                \n                    \n                 \n  \n    \n      \n      \n      \n      \n\t\tNovember 13, 2011\t  \n      \n\t\n  \n\tGoogle Workspace makes work easier\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tGoogle Apps for Work\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tNovember 12, 2011\t  \n      \n\t\n  \n\tRecommendations\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t“Douglas is extremely knowledgable in his field and he offers amazing and thorough services.”&nbsp;October 18, 2011 Top qualities:&nbsp;Great Results, Personable, Expert Vanessa Briones,&nbsp;hired Douglas as a IT Consultant in 2011 &nbsp; “I am pleased to write a letter of reference for Doug Baumwall. Doug is an expert in Google Apps. Doug was able to provide [&hellip;]\n\t\n\n\tRead More\n\n            \n                        \n                &laquo; Previous\n1\n&hellip;\n8\n9\n10","excerpt":"Recent Posts November 13, 2011 Google Workspace makes work easier easyG Google Apps for Work Read More November 12, 2011..","path":"\/blog\/page\/10\/"},{"objectID":"601","title":"I want to sign up for Google Workspace with my own domain name. Is this possible?","content":"I want to sign up for Google Workspace with my own domain name. Is this possible?","excerpt":"I want to sign up for Google Workspace with my own domain name. Is this possible?","path":"\/faq-item\/sign-up-for-workspace-my-own-domain-name\/"},{"objectID":"608","title":"Does Google host websites too?","content":"Does Google host websites too?","excerpt":"Does Google host websites too?","path":"\/faq-item\/does-google-host-websites-too\/"},{"objectID":"343","title":".CSV","content":".CSV","excerpt":".CSV","path":"\/glossary\/csv\/"},{"objectID":"302","title":"A Record","content":"A Record","excerpt":"A Record","path":"\/glossary\/a-record\/"},{"objectID":"304","title":"Abuse","content":"Abuse","excerpt":"Abuse","path":"\/glossary\/abuse\/"},{"objectID":"306","title":"Account Type","content":"Account Type","excerpt":"Account Type","path":"\/glossary\/account-type\/"},{"objectID":"319","title":"Admin console","content":"Admin console","excerpt":"Admin console","path":"\/glossary\/admin-console\/"},{"objectID":"317","title":"Administrator Account","content":"Administrator Account","excerpt":"Administrator Account","path":"\/glossary\/administrator-account\/"},{"objectID":"321","title":"Alias","content":"Alias","excerpt":"Alias","path":"\/glossary\/alias\/"},{"objectID":"323","title":"API","content":"API","excerpt":"API","path":"\/glossary\/323\/"},{"objectID":"329","title":"Attachment routing","content":"Attachment routing","excerpt":"Attachment routing","path":"\/glossary\/attachment-routing\/"},{"objectID":"365","title":"Content routing or attachment routing","content":"Content routing or attachment routing","excerpt":"Content routing or attachment routing","path":"\/glossary\/content-routing-or-attachment-routing\/"},{"objectID":"309","title":"Glossary","content":"Glossary\n\n\n\nAuto-forwardingA feature of Gmail used to redirect some or all of your messages to another email address.\n\n\nAutomatic RenewalAn option in the admin console that allows automatic renewal of domain subscription after one year from the date of account creation or last domain renewal.\n\n\nBIMIIs an acronym for \"Brand Indicators for Message Identification\". BIMI (pronounced: Bih-mee) is an emerging email specification that enables the use of brand-controlled logos within supporting email clients. BIMI leverages the work an organization has put into deploying DMARC protection, by bringing brand logos to the customer&rsquo;s inbox. For the brand&rsquo;s logo to be displayed, the email must pass DMARC authentication checks, ensuring that the organization&rsquo;s domain has not been impersonated.\n\n\nBlogger Custom DomainUse a custom domain name for your blog.\n\n\nBrowserA web browser is the application you use to view websites. The web browser is arguably the most important piece of software on your computer. You spend much of your time online inside a browser: When you search, chat, email, shop, bank, read the news, and watch videos online, you often do all this using a browser. Internet Explorer is Microsoft's web browser. Chrome is Google's web browser.\n\n\nBulk Account UpdateThis feature allows you to create and update many user accounts at the same time with a .csv file.\n\n\nBusiness Standard\nA powerful edition of Google Workspace. A cloud based suite of email, calendar, instant message, voice, video and collaboration tools that increases business productivity better than any other solution. Formerly Google Workspace. Formerly Google Apps for Your Domain. Formerly Google Apps for Business. Formerly Google Apps for Work Unlimited&nbsp;Learn more.\n\n\n\nCatch-all AddressA catch-all address will allow you to receive any mail sent to your domain that doesn't match an existing alias.\n\n\nChatAlso known as Instant messaging. If chat is enabled by your administrator for your domain, you may download the chat app and use your e-mail account's chat features to talk to people from directly within your inbox.\n\n\nChrome browserGoogle's fast, free web browser. Chrome is the best way to use Google Workspace!\n                    \n                                            \n                                        \n                        \n                            &laquo; Previous\n1\n2\n3\n4\n&hellip;\n14\nNext &raquo;","excerpt":"Glossary Auto-forwardingA feature of Gmail used to redirect some or all of your messages to another email address. Automatic RenewalAn..","path":"\/glossary-terms\/page\/2\/"},{"objectID":"309","title":"Glossary","content":"Glossary\n\n\n\nChrome remote desktopAccess other computers or allows another user to access your computer securely over the Internet: chrome.google.com\/remotedesktop.\n\n\n\nChromebookFast, intuitive and easy-to-manage computer designed to keep data and users safe while delivering all the power of the web. Chromebooks look like laptops but have six to eight hour battery life, and go from off to the web in eight to ten seconds!\n\n\nCloud computing\nCloud computing is internet-based computing in which large groups of remote computer servers are networked to serve resources more efficiently. This network is shared and not tied to any specific location. Cloud Computing is for software developers, application vendors, savvy computer users, and corporate IT departments, not for end-users of software applications. It basically consists of:\n\nVirtual computers\/servers\nData storage capacity\nCommunication\/messaging capacity\nNetwork capacity\nDevelopment environments\n\n\n\n\nCNAME Record\nCanonical Name or CNAME records link an alias name to another canonical domain name. For instance, www.example.com might link to example.com. You'll need to use CNAME records if you want to configure a custom URL for specific Google Workspace services or a Google Site (like sites.mydomain.com).\n\n\n\nConsumerization\nIs the growing tendency for new information technology to emerge first in the consumer market and then spread into business and government organizations. The emergence of consumer markets as the primary driver of IT innovation has reached the tipping point in the shift away from traditional IT created by big business and government organizations.\n\n\n\nContact Information\nYour contact email addresses (in Account information under Domain settings) for all official service communications including password recovery and payment notifications.\n\n\n\nContact Sharing\nThis feature populates a user's Contacts list with all users at your domain, suggests users' email addresses with auto-complete, and allows users to chat with a convenient Quick Contacts list.\n\n\n\nContent routing or attachment routing\nDefine mail routes based on message content or attachment type.\n\n\n\nConversations or Conversation View\nOne of the important features that differentiates Gmail from on-premise email software like Outlook. Conversations is a term used to describe Gmail's approach to organizing messages that are sent back and forth which share the same subject. Gmail stacks all messages with the same subject in one place, making it easier to understand the context of each message and the meaning of messages as a group. In legacy email software, each message response appears separately, forcing you to wade through your entire inbox to follow the conversation. Although this may initially look confusing to Outlook users, Conversation View allows people to quickly organize their inbox and become more productive. This feature is controlled at the domain level by administrators and may also be turned on and off by individual users.\n\n\n\nCustom Logo\nYou can choose your own logo to be displayed on all services for your domain. Uploading your own logo will replace the default Google and Gmail logos.\n\n                    \n                                            \n                                        \n                        \n                            &laquo; Previous\n1\n2\n3\n4\n5\n&hellip;\n14\nNext &raquo;","excerpt":"Glossary Chrome remote desktopAccess other computers or allows another user to access your computer securely over the Internet: chrome.google.com\/remotedesktop. ChromebookFast,..","path":"\/glossary-terms\/page\/3\/"},{"objectID":"309","title":"Glossary","content":"Glossary\n\n\n\nWeb Publishing Address\nURL for your web pages.\n\n\n\nWHOIS\nA public listing of domain names, and people or organizations associated with each domain name. See Basic Guide to DNS\n\n\n\nWWW\nThe most common subdomain for websites.\n\n                    \n                                            \n                                        \n                        \n                            &laquo; Previous\n1\n&hellip;\n12\n13\n14","excerpt":"Glossary Web Publishing Address URL for your web pages. WHOIS A public listing of domain names, and people or organizations..","path":"\/glossary-terms\/page\/14\/"},{"objectID":"100","title":"November 6, 2014","content":"November 6, 2014\nMeet your new inbox","excerpt":"November 6, 2014 Meet your new inbox","path":"\/blog\/meet-your-new-inbox\/"},{"objectID":"123","title":"April 18, 2017","content":"April 18, 2017\nMeet the new Hangouts","excerpt":"April 18, 2017 Meet the new Hangouts","path":"\/blog\/meet-the-new-hangouts\/"},{"objectID":"105","title":"February 2, 2015","content":"February 2, 2015\nGoogle Meet Training Lessons","excerpt":"February 2, 2015 Google Meet Training Lessons","path":"\/blog\/google-meet-training-lessons\/"},{"objectID":"92","title":"June 6, 2014","content":"June 6, 2014\neasyG Cloud.com Becomes a Google Workspace Premier Partner","excerpt":"June 6, 2014 easyG Cloud.com Becomes a Google Workspace Premier Partner","path":"\/blog\/easyg-apps-com-becomes-a-google-apps-premier-reseller\/"},{"objectID":"122","title":"April 18, 2017","content":"April 18, 2017\nCheck out Google Workspace","excerpt":"April 18, 2017 Check out Google Workspace","path":"\/google-enterprise\/check-out-g-suite\/"},{"objectID":"121","title":"March 28, 2017","content":"March 28, 2017\nNew Calendar administrator privileges available in the Admin console","excerpt":"March 28, 2017 New Calendar administrator privileges available in the Admin console","path":"\/blog\/new-calendar-administrator-privileges-available-in-the-admin-console\/"},{"objectID":"120","title":"February 28, 2017","content":"February 28, 2017\nGoogle Keep has become a Google Workspace core service","excerpt":"February 28, 2017 Google Keep has become a Google Workspace core service","path":"\/blog\/google-keep-has-become-a-g-suite-core-service\/"},{"objectID":"119","title":"December 30, 2016","content":"December 30, 2016\nAction items are better than attachments","excerpt":"December 30, 2016 Action items are better than attachments","path":"\/tips-tricks\/action-items-are-better-than-attachments\/"},{"objectID":"117","title":"January 5, 2016","content":"January 5, 2016\nReminders in Google Calendar","excerpt":"January 5, 2016 Reminders in Google Calendar","path":"\/blog\/reminders-in-google-calendar\/"},{"objectID":"116","title":"November 13, 2015","content":"November 13, 2015\nGmail and Inbox by Google","excerpt":"November 13, 2015 Gmail and Inbox by Google","path":"\/blog\/gmail-and-inbox-by-google\/"},{"objectID":"115","title":"October 11, 2015","content":"October 11, 2015\nProject Management in Google Apps","excerpt":"October 11, 2015 Project Management in Google Apps","path":"\/blog\/project-management-in-google-apps\/"},{"objectID":"113","title":"September 10, 2015","content":"September 10, 2015\nTransform your work with Google","excerpt":"September 10, 2015 Transform your work with Google","path":"\/blog\/transform-your-work-with-google\/"},{"objectID":"112","title":"August 27, 2015","content":"August 27, 2015\nCreate a new Google Doc quickly","excerpt":"August 27, 2015 Create a new Google Doc quickly","path":"\/blog\/create-a-new-google-doc-quickly\/"},{"objectID":"111","title":"August 18, 2015","content":"August 18, 2015\nFinally, an easy to use router!","excerpt":"August 18, 2015 Finally, an easy to use router!","path":"\/blog\/finally-an-easy-to-use-router\/"},{"objectID":"109","title":"May 17, 2015","content":"May 17, 2015\nGetting things done","excerpt":"May 17, 2015 Getting things done","path":"\/blog\/getting-things-done\/"},{"objectID":"108","title":"March 5, 2015","content":"March 5, 2015\nAndroid for Work","excerpt":"March 5, 2015 Android for Work","path":"\/blog\/android-for-work\/"},{"objectID":"107","title":"March 1, 2015","content":"March 1, 2015\nWork faster with keyboard shortcuts","excerpt":"March 1, 2015 Work faster with keyboard shortcuts","path":"\/blog\/work-faster-with-keyboard-shortcuts\/"},{"objectID":"106","title":"February 9, 2015","content":"February 9, 2015\nGoogle versus Microsoft","excerpt":"February 9, 2015 Google versus Microsoft","path":"\/blog\/google-versus-microsoft\/"},{"objectID":"104","title":"January 30, 2015","content":"January 30, 2015\nGoogle Now becomes more useful","excerpt":"January 30, 2015 Google Now becomes more useful","path":"\/blog\/google-now-becomes-more-useful\/"},{"objectID":"103","title":"January 9, 2015","content":"January 9, 2015\nGreat way to improve your business","excerpt":"January 9, 2015 Great way to improve your business","path":"\/blog\/great-way-to-improve-your-business\/"},{"objectID":"102","title":"November 25, 2014","content":"November 25, 2014\nImprove online security","excerpt":"November 25, 2014 Improve online security","path":"\/blog\/improve-online-security\/"},{"objectID":"101","title":"November 24, 2014","content":"November 24, 2014\nTerabyte of free storage with Chromebooks","excerpt":"November 24, 2014 Terabyte of free storage with Chromebooks","path":"\/blog\/terabyte-of-free-storage-with-chromebooks\/"},{"objectID":"99","title":"October 14, 2014","content":"October 14, 2014\nNew tool to analyze Gmail","excerpt":"October 14, 2014 New tool to analyze Gmail","path":"\/blog\/new-tool-to-analyze-gmail\/"},{"objectID":"98","title":"September 13, 2014","content":"September 13, 2014\nVoice, text &#038; video continue to converge","excerpt":"September 13, 2014 Voice, text &#038; video continue to converge","path":"\/blog\/voice-text-video-continue-to-converge\/"},{"objectID":"96","title":"August 9, 2014","content":"August 9, 2014\nEdit Microsoft Office files in Google Docs, Sheets, &#038; Slides","excerpt":"August 9, 2014 Edit Microsoft Office files in Google Docs, Sheets, &#038; Slides","path":"\/blog\/edit-microsoft-office-files-in-google-docs-sheets-slides\/"},{"objectID":"95","title":"August 9, 2014","content":"August 9, 2014\nNew bulk mail spam filter","excerpt":"August 9, 2014 New bulk mail spam filter","path":"\/blog\/new-bulk-mail-spam-filter\/"},{"objectID":"131","title":"June 22, 2014","content":"June 22, 2014\nReimagine how your team works","excerpt":"June 22, 2014 Reimagine how your team works","path":"\/video\/reimagine-how-your-team-works\/"},{"objectID":"93","title":"June 16, 2014","content":"June 16, 2014\nGoogle+ Profile or Page?","excerpt":"June 16, 2014 Google+ Profile or Page?","path":"\/blog\/google-profile-or-page\/"},{"objectID":"90","title":"May 2, 2014","content":"May 2, 2014\nKing of Docs Shortcuts","excerpt":"May 2, 2014 King of Docs Shortcuts","path":"\/blog\/king-of-docs-shortcuts\/"},{"objectID":"89","title":"April 21, 2014","content":"April 21, 2014\nVan Teal evolves from Novell Groupwise to Google Apps for Business","excerpt":"April 21, 2014 Van Teal evolves from Novell Groupwise to Google Apps for Business","path":"\/easygapps\/van-teal-evolves-from-novell-groupwise-to-google-apps-for-business\/"},{"objectID":"88","title":"April 21, 2014","content":"April 21, 2014\nBrittex Appraisal Services streamlines workflow with Google Apps for Business","excerpt":"April 21, 2014 Brittex Appraisal Services streamlines workflow with Google Apps for Business","path":"\/easygapps\/brittex-appraisal-services-streamlines-workflow-with-google-apps-for-business\/"},{"objectID":"87","title":"April 21, 2014","content":"April 21, 2014\nEmail Inbox Type","excerpt":"April 21, 2014 Email Inbox Type","path":"\/blog\/email-inbox-type\/"},{"objectID":"91","title":"April 1, 2014","content":"April 1, 2014\nPain free conference calls","excerpt":"April 1, 2014 Pain free conference calls","path":"\/video\/pain-free-conference-calls\/"},{"objectID":"85","title":"December 13, 2013","content":"December 13, 2013\nMore Tips from Google","excerpt":"December 13, 2013 More Tips from Google","path":"\/blog\/more-tips-from-google\/"},{"objectID":"84","title":"October 31, 2013","content":"October 31, 2013\nStart using Google Chrome Browser","excerpt":"October 31, 2013 Start using Google Chrome Browser","path":"\/blog\/start-using-google-chrome-browser\/"},{"objectID":"82","title":"October 8, 2013","content":"October 8, 2013\nShare Google Drive files with people who do not have a Google Account","excerpt":"October 8, 2013 Share Google Drive files with people who do not have a Google Account","path":"\/blog\/share-google-drive-files-with-people-who-do-not-have-a-google-account\/"},{"objectID":"81","title":"September 20, 2013","content":"September 20, 2013\nShare Drive files with Circles","excerpt":"September 20, 2013 Share Drive files with Circles","path":"\/blog\/share-drive-files-with-circles\/"},{"objectID":"79","title":"September 11, 2013","content":"September 11, 2013\nAlternate row shading in Google sheets","excerpt":"September 11, 2013 Alternate row shading in Google sheets","path":"\/blog\/alternate-row-shading-in-google-sheets\/"},{"objectID":"78","title":"August 30, 2013","content":"August 30, 2013\nTransfer Google+ connections between accounts","excerpt":"August 30, 2013 Transfer Google+ connections between accounts","path":"\/blog\/transfer-google-connections-between-accounts\/"},{"objectID":"77","title":"August 1, 2013","content":"August 1, 2013\nChrome Remote Desktop","excerpt":"August 1, 2013 Chrome Remote Desktop","path":"\/blog\/chrome-remote-desktop\/"},{"objectID":"76","title":"June 23, 2013","content":"June 23, 2013\nEverything you always wanted to know about Google Apps","excerpt":"June 23, 2013 Everything you always wanted to know about Google Apps","path":"\/blog\/everything-you-always-wanted-to-know-about-google-apps\/"},{"objectID":"74","title":"June 9, 2013","content":"June 9, 2013\nGoogle Apps for Business Case Studies","excerpt":"June 9, 2013 Google Apps for Business Case Studies","path":"\/blog\/google-apps-for-business-case-studies\/"},{"objectID":"73","title":"June 9, 2013","content":"June 9, 2013\nGoogle Workspace Case Studies","excerpt":"June 9, 2013 Google Workspace Case Studies","path":"\/google-enterprise\/google-apps-case-studies\/"},{"objectID":"72","title":"June 2, 2013","content":"June 2, 2013\nRemember 2012","excerpt":"June 2, 2013 Remember 2012","path":"\/blog\/remember-2012\/"},{"objectID":"71","title":"May 9, 2013","content":"May 9, 2013\nAre you in inbox purgatory","excerpt":"May 9, 2013 Are you in inbox purgatory","path":"\/blog\/are-you-in-inbox-purgatory\/"},{"objectID":"70","title":"May 2, 2013","content":"May 2, 2013\nGoogle Keep is a brand new App","excerpt":"May 2, 2013 Google Keep is a brand new App","path":"\/blog\/google-keep-is-a-brand-new-app\/"},{"objectID":"67","title":"March 20, 2013","content":"March 20, 2013\nGoogle Keep","excerpt":"March 20, 2013 Google Keep","path":"\/blog\/google-keep\/"},{"objectID":"64","title":"December 5, 2012","content":"December 5, 2012\nNew Gmail App for iPhone","excerpt":"December 5, 2012 New Gmail App for iPhone","path":"\/blog\/new-gmail-app-for-iphone\/"},{"objectID":"63","title":"November 21, 2012","content":"November 21, 2012\nLife after 25GB","excerpt":"November 21, 2012 Life after 25GB","path":"\/blog\/life-after-25gb\/"},{"objectID":"62","title":"November 14, 2012","content":"November 14, 2012\nSearch for email by size in Gmail","excerpt":"November 14, 2012 Search for email by size in Gmail","path":"\/blog\/search-for-email-by-size-in-gmail\/"},{"objectID":"61","title":"November 8, 2012","content":"November 8, 2012\nChrome is always getting faster","excerpt":"November 8, 2012 Chrome is always getting faster","path":"\/blog\/chrome-is-always-getting-faster\/"},{"objectID":"60","title":"November 5, 2012","content":"November 5, 2012\nHurricane Sandy Discount","excerpt":"November 5, 2012 Hurricane Sandy Discount","path":"\/blog\/hurricane-sandy-discount\/"},{"objectID":"59","title":"October 31, 2012","content":"October 31, 2012\nOctober 2012 Newsletter","excerpt":"October 31, 2012 October 2012 Newsletter","path":"\/blog\/october-2012-newsletter\/"},{"objectID":"56","title":"October 1, 2012","content":"October 1, 2012\nGoogle for Entrepreneurs","excerpt":"October 1, 2012 Google for Entrepreneurs","path":"\/blog\/google-for-entrepreneurs\/"},{"objectID":"55","title":"October 1, 2012","content":"October 1, 2012\nFraternity Goes Google","excerpt":"October 1, 2012 Fraternity Goes Google","path":"\/blog\/fraternity-goes-google\/"},{"objectID":"49","title":"September 1, 2012","content":"September 1, 2012\nNewsletter August 2012","excerpt":"September 1, 2012 Newsletter August 2012","path":"\/blog\/newsletter-august-2012-2\/"},{"objectID":"48","title":"September 1, 2012","content":"September 1, 2012\nNewsletter August 2012","excerpt":"September 1, 2012 Newsletter August 2012","path":"\/newsletter\/newsletter-august-2012\/"},{"objectID":"45","title":"July 31, 2012","content":"July 31, 2012\nGoogle Docs Demonstration","excerpt":"July 31, 2012 Google Docs Demonstration","path":"\/blog\/google-docs-demonstration\/"},{"objectID":"44","title":"July 27, 2012","content":"July 27, 2012\nAutomatic deletion of file versions","excerpt":"July 27, 2012 Automatic deletion of file versions","path":"\/blog\/automatic-deletion-of-file-versions\/"},{"objectID":"43","title":"July 21, 2012","content":"July 21, 2012\nGoogle Drive for iOS","excerpt":"July 21, 2012 Google Drive for iOS","path":"\/blog\/google-drive-for-ios\/"},{"objectID":"42","title":"July 6, 2012","content":"July 6, 2012\nGoogle Apps Tips and Tricks","excerpt":"July 6, 2012 Google Apps Tips and Tricks","path":"\/tips-tricks\/google-apps-tips-and-tricks\/"},{"objectID":"38","title":"July 3, 2012","content":"July 3, 2012\nJelly Bean Search Video","excerpt":"July 3, 2012 Jelly Bean Search Video","path":"\/blog\/jelly-bean-search-video\/"},{"objectID":"37","title":"June 29, 2012","content":"June 29, 2012\nWorld's most powerful tool","excerpt":"June 29, 2012 World's most powerful tool","path":"\/blog\/world-s-most-powerful-tool\/"},{"objectID":"36","title":"May 1, 2012","content":"May 1, 2012\nGoogle Vault","excerpt":"May 1, 2012 Google Vault","path":"\/blog\/google-apps-vault-2\/"},{"objectID":"35","title":"April 25, 2012","content":"April 25, 2012\nGoogle Drive","excerpt":"April 25, 2012 Google Drive","path":"\/blog\/google-drive-2\/"},{"objectID":"41","title":"November 17, 2011","content":"November 17, 2011\nWork Smarter","excerpt":"November 17, 2011 Work Smarter","path":"\/video\/work-smarter\/"},{"objectID":"46","title":"November 17, 2011","content":"November 17, 2011\nManage Mobile Users","excerpt":"November 17, 2011 Manage Mobile Users","path":"\/video\/manage-mobile-users\/"},{"objectID":"47","title":"November 17, 2011","content":"November 17, 2011\nWhat its like Going Google","excerpt":"November 17, 2011 What its like Going Google","path":"\/video\/what-its-like-going-google\/"},{"objectID":"50","title":"November 17, 2011","content":"November 17, 2011\nGroup Collaborative Inbox","excerpt":"November 17, 2011 Group Collaborative Inbox","path":"\/video\/group-collaborative-inbox\/"},{"objectID":"53","title":"November 17, 2011","content":"November 17, 2011\nGoogle Cloud Security","excerpt":"November 17, 2011 Google Cloud Security","path":"\/video\/google-security\/"},{"objectID":"54","title":"November 17, 2011","content":"November 17, 2011\nPriority Inbox","excerpt":"November 17, 2011 Priority Inbox","path":"\/video\/priority-inbox\/"},{"objectID":"58","title":"November 17, 2011","content":"November 17, 2011\nGoing Google","excerpt":"November 17, 2011 Going Google","path":"\/video\/going-google\/"},{"objectID":"65","title":"November 17, 2011","content":"November 17, 2011\nGmail Advanced Search","excerpt":"November 17, 2011 Gmail Advanced Search","path":"\/video\/gmail-advanced-search\/"},{"objectID":"66","title":"November 17, 2011","content":"November 17, 2011\nHangout video meeting","excerpt":"November 17, 2011 Hangout video meeting","path":"\/video\/hangout-video-meeting\/"},{"objectID":"83","title":"November 17, 2011","content":"November 17, 2011\nInbox Zero","excerpt":"November 17, 2011 Inbox Zero","path":"\/video\/inbox-zero\/"},{"objectID":"86","title":"November 17, 2011","content":"November 17, 2011\nUse Forms in Google Drive","excerpt":"November 17, 2011 Use Forms in Google Drive","path":"\/video\/use-forms-in-google-drive\/"},{"objectID":"114","title":"November 17, 2011","content":"November 17, 2011\nExplore a Google Data Center","excerpt":"November 17, 2011 Explore a Google Data Center","path":"\/video\/explore-a-google-data-center\/"},{"objectID":"9","title":"November 13, 2011","content":"November 13, 2011\nSite Map","excerpt":"November 13, 2011 Site Map","path":"\/easygapps\/site-map\/"},{"objectID":"97","title":"November 13, 2011","content":"November 13, 2011\nGoogle Workspace makes work easier","excerpt":"November 13, 2011 Google Workspace makes work easier","path":"\/video\/google-apps-makes-work-easier\/"},{"objectID":"1","title":"November 12, 2011","content":"November 12, 2011\nRecommendations","excerpt":"November 12, 2011 Recommendations","path":"\/easygapps\/recommendations\/"},{"objectID":"774","title":"New Project","content":"New Project","excerpt":"New Project","path":"\/new-project\/"},{"objectID":"611","title":"","content":"","excerpt":"","path":"\/customer\/"},{"objectID":"608","title":"Recent Posts","content":"Recent Posts        \n                \n                    \n                 \n  \n    \n      \n      \n      \n      \n\t\tNovember 4, 2022\t  \n      \n\t\n  \n\tDoes Google host websites?\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tNovember 4, 2022\t  \n      \n\t\n  \n\tCan we use Google Workspace with our domain name?\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More","excerpt":"Recent Posts November 4, 2022 Does Google host websites? easyG Read More November 4, 2022 Can we use Google Workspace..","path":"\/faq-item\/"},{"objectID":"577","title":"Recent Posts","content":"Recent Posts        \n                \n                    \n                 \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tWWW\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tWHOIS\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tWeb Publishing Address\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tWarning Message\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tVideo\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tUser E-mail Uploads\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tUsername\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tUser-customizable Columns\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tURL\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tTXT Record\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n            \n                        \n                1\n2\n3\n&hellip;\n14\nNext &raquo;","excerpt":"Recent Posts October 19, 2022 WWW easyG Read More October 19, 2022 WHOIS easyG Read More October 19, 2022 Web..","path":"\/glossary\/"},{"objectID":"377","title":"DMARC","content":"DMARC","excerpt":"DMARC","path":"\/glossary\/dmarc\/"},{"objectID":"421","title":"Google Workspace (formerly G Suite) plans","content":"Google Workspace (formerly G Suite) plans","excerpt":"Google Workspace (formerly G Suite) plans","path":"\/glossary\/google-workspace-formerly-g-suite-editions\/"},{"objectID":"443","title":"Google Cloud Partner","content":"Google Cloud Partner","excerpt":"Google Cloud Partner","path":"\/glossary\/google-cloud-partner\/"},{"objectID":"427","title":"Google Cloud Partners","content":"Google Cloud Partners","excerpt":"Google Cloud Partners","path":"\/glossary\/google-cloud-partners\/"},{"objectID":"433","title":"Google Workspace Migration for Microsoft Exchange","content":"Google Workspace Migration for Microsoft Exchange","excerpt":"Google Workspace Migration for Microsoft Exchange","path":"\/glossary\/google-workspace-migration-for-microsoft-exchange\/"},{"objectID":"325","title":"Status Dashboard","content":"Status Dashboard","excerpt":"Status Dashboard","path":"\/glossary\/status-dashboard\/"},{"objectID":"331","title":"Auto-forwarding","content":"Auto-forwarding","excerpt":"Auto-forwarding","path":"\/glossary\/auto-forwarding\/"},{"objectID":"333","title":"Automatic Renewal","content":"Automatic Renewal","excerpt":"Automatic Renewal","path":"\/glossary\/automatic-renewal\/"},{"objectID":"335","title":"BIMI","content":"BIMI","excerpt":"BIMI","path":"\/glossary\/bimi\/"},{"objectID":"337","title":"Browser","content":"Browser","excerpt":"Browser","path":"\/glossary\/browser\/"},{"objectID":"339","title":"Bulk Account Update","content":"Bulk Account Update","excerpt":"Bulk Account Update","path":"\/glossary\/bulk-account-update\/"},{"objectID":"341","title":"Blogger Custom Domain","content":"Blogger Custom Domain","excerpt":"Blogger Custom Domain","path":"\/glossary\/blogger-custom-domain\/"},{"objectID":"345","title":"Catch-all Address","content":"Catch-all Address","excerpt":"Catch-all Address","path":"\/glossary\/catch-all-address\/"},{"objectID":"347","title":"Chat","content":"Chat","excerpt":"Chat","path":"\/glossary\/chat\/"},{"objectID":"349","title":"Chrome browser","content":"Chrome browser","excerpt":"Chrome browser","path":"\/glossary\/chrome-browser\/"},{"objectID":"351","title":"Chrome remote desktop","content":"Chrome remote desktop","excerpt":"Chrome remote desktop","path":"\/glossary\/chrome-remote-desktop\/"},{"objectID":"353","title":"Chromebook","content":"Chromebook","excerpt":"Chromebook","path":"\/glossary\/chromebook\/"},{"objectID":"355","title":"Cloud computing","content":"Cloud computing","excerpt":"Cloud computing","path":"\/glossary\/cloud-computing\/"},{"objectID":"357","title":"CNAME Record","content":"CNAME Record","excerpt":"CNAME Record","path":"\/glossary\/cname-record\/"},{"objectID":"359","title":"Consumerization","content":"Consumerization","excerpt":"Consumerization","path":"\/glossary\/consumerization\/"},{"objectID":"361","title":"Contact Information","content":"Contact Information","excerpt":"Contact Information","path":"\/glossary\/contact-information\/"},{"objectID":"363","title":"Contact Sharing","content":"Contact Sharing","excerpt":"Contact Sharing","path":"\/glossary\/contact-sharing\/"},{"objectID":"367","title":"Conversations or Conversation View","content":"Conversations or Conversation View","excerpt":"Conversations or Conversation View","path":"\/glossary\/conversations-or-conversation-view\/"},{"objectID":"369","title":"Custom Logo","content":"Custom Logo","excerpt":"Custom Logo","path":"\/glossary\/custom-logo\/"},{"objectID":"371","title":"Custom URL","content":"Custom URL","excerpt":"Custom URL","path":"\/glossary\/custom-url\/"},{"objectID":"373","title":"Direct delivery","content":"Direct delivery","excerpt":"Direct delivery","path":"\/glossary\/direct-delivery\/"},{"objectID":"375","title":"DKIM","content":"DKIM","excerpt":"DKIM","path":"\/glossary\/dkim\/"},{"objectID":"379","title":"DNS","content":"DNS","excerpt":"DNS","path":"\/glossary\/dns\/"},{"objectID":"381","title":"Domain Alias","content":"Domain Alias","excerpt":"Domain Alias","path":"\/glossary\/domain-alias\/"},{"objectID":"383","title":"Domain Host","content":"Domain Host","excerpt":"Domain Host","path":"\/glossary\/domain-host\/"},{"objectID":"385","title":"Domain Name","content":"Domain Name","excerpt":"Domain Name","path":"\/glossary\/domain-name\/"},{"objectID":"387","title":"Domain Registrar","content":"Domain Registrar","excerpt":"Domain Registrar","path":"\/glossary\/domain-registrar\/"},{"objectID":"389","title":"Domain Ownership","content":"Domain Ownership","excerpt":"Domain Ownership","path":"\/glossary\/domain-ownership\/"},{"objectID":"391","title":"Domain Registration","content":"Domain Registration","excerpt":"Domain Registration","path":"\/glossary\/domain-registration\/"},{"objectID":"393","title":"Dual delivery \/ multiple delivery","content":"Dual delivery \/ multiple delivery","excerpt":"Dual delivery \/ multiple delivery","path":"\/glossary\/dual-delivery-multiple-delivery\/"},{"objectID":"395","title":"Easy","content":"Easy","excerpt":"Easy","path":"\/glossary\/easy\/"},{"objectID":"397","title":"Email Routing","content":"Email Routing","excerpt":"Email Routing","path":"\/glossary\/email-routing\/"},{"objectID":"399","title":"Email Migration","content":"Email Migration","excerpt":"Email Migration","path":"\/glossary\/email-migration\/"},{"objectID":"401","title":"Email Whitelist","content":"Email Whitelist","excerpt":"Email Whitelist","path":"\/glossary\/email-whitelist\/"},{"objectID":"403","title":"Filters","content":"Filters","excerpt":"Filters","path":"\/glossary\/filters\/"},{"objectID":"405","title":"Full Header","content":"Full Header","excerpt":"Full Header","path":"\/glossary\/full-header\/"},{"objectID":"407","title":"Form","content":"Form","excerpt":"Form","path":"\/glossary\/form\/"},{"objectID":"409","title":"Google","content":"Google","excerpt":"Google","path":"\/glossary\/google\/"},{"objectID":"411","title":"GooglePlex","content":"GooglePlex","excerpt":"GooglePlex","path":"\/glossary\/googleplex\/"},{"objectID":"413","title":"Google+","content":"Google+","excerpt":"Google+","path":"\/glossary\/google-2\/"},{"objectID":"415","title":"Google Account","content":"Google Account","excerpt":"Google Account","path":"\/glossary\/google-account\/"},{"objectID":"417","title":"Google App Engine","content":"Google App Engine","excerpt":"Google App Engine","path":"\/glossary\/google-app-engine\/"},{"objectID":"419","title":"Google Apps (legacy free edition)","content":"Google Apps (legacy free edition)","excerpt":"Google Apps (legacy free edition)","path":"\/glossary\/google-apps-legacy-free-edition\/"},{"objectID":"423","title":"Google Certified Sales Specialist","content":"Google Certified Sales Specialist","excerpt":"Google Certified Sales Specialist","path":"\/glossary\/google-certified-sales-specialist\/"},{"objectID":"425","title":"Google Certified Deployment Specialist","content":"Google Certified Deployment Specialist","excerpt":"Google Certified Deployment Specialist","path":"\/glossary\/google-certified-deployment-specialist\/"},{"objectID":"429","title":"Business Standard","content":"Business Standard","excerpt":"Business Standard","path":"\/glossary\/business-standard\/"},{"objectID":"431","title":"Google Workspace Migration","content":"Google Workspace Migration","excerpt":"Google Workspace Migration","path":"\/glossary\/google-workspace-migration\/"},{"objectID":"435","title":"Google Workspace Migration for Microsoft Outlook","content":"Google Workspace Migration for Microsoft Outlook","excerpt":"Google Workspace Migration for Microsoft Outlook","path":"\/glossary\/google-workspace-migration-for-microsoft-outlook\/"},{"objectID":"437","title":"Google Workspace Migration for Lotus Notes","content":"Google Workspace Migration for Lotus Notes","excerpt":"Google Workspace Migration for Lotus Notes","path":"\/glossary\/google-workspace-migration-for-lotus-notes\/"},{"objectID":"439","title":"Google Workspace Migration for Novell GroupWise","content":"Google Workspace Migration for Novell GroupWise","excerpt":"Google Workspace Migration for Novell GroupWise","path":"\/glossary\/google-workspace-migration-for-novell-groupwise\/"},{"objectID":"445","title":"Google Calendar","content":"Google Calendar","excerpt":"Google Calendar","path":"\/glossary\/google-calendar\/"},{"objectID":"447","title":"Google Docs","content":"Google Docs","excerpt":"Google Docs","path":"\/glossary\/google-docs\/"},{"objectID":"449","title":"Google Gadgets","content":"Google Gadgets","excerpt":"Google Gadgets","path":"\/glossary\/google-gadgets\/"},{"objectID":"451","title":"Google Groups","content":"Google Groups","excerpt":"Google Groups","path":"\/glossary\/google-groups\/"},{"objectID":"453","title":"Google Hangout","content":"Google Hangout","excerpt":"Google Hangout","path":"\/glossary\/google-hangout\/"},{"objectID":"455","title":"Google Mail","content":"Google Mail","excerpt":"Google Mail","path":"\/glossary\/google-mail\/"},{"objectID":"457","title":"Google Plus","content":"Google Plus","excerpt":"Google Plus","path":"\/glossary\/google-plus\/"},{"objectID":"459","title":"Google Sites","content":"Google Sites","excerpt":"Google Sites","path":"\/glossary\/google-sites\/"},{"objectID":"461","title":"Google Talk Client","content":"Google Talk Client","excerpt":"Google Talk Client","path":"\/glossary\/google-talk-client\/"},{"objectID":"463","title":"Google Video for Business","content":"Google Video for Business","excerpt":"Google Video for Business","path":"\/glossary\/google-video-for-business\/"},{"objectID":"465","title":"Google Voice and Voice and Video Chat Plugin","content":"Google Voice and Voice and Video Chat Plugin","excerpt":"Google Voice and Voice and Video Chat Plugin","path":"\/glossary\/google-voice-and-voice-and-video-chat-plugin\/"},{"objectID":"467","title":"Googol","content":"Googol","excerpt":"Googol","path":"\/glossary\/googol\/"},{"objectID":"469","title":"Googolplex","content":"Googolplex","excerpt":"Googolplex","path":"\/glossary\/googolplex\/"},{"objectID":"471","title":"Hangouts","content":"Hangouts","excerpt":"Hangouts","path":"\/glossary\/hangouts\/"},{"objectID":"473","title":"Headers","content":"Headers","excerpt":"Headers","path":"\/glossary\/headers\/"},{"objectID":"475","title":"Host","content":"Host","excerpt":"Host","path":"\/glossary\/host\/"},{"objectID":"477","title":"Instant Messaging","content":"Instant Messaging","excerpt":"Instant Messaging","path":"\/glossary\/instant-messaging\/"},{"objectID":"479","title":"IMAP","content":"IMAP","excerpt":"IMAP","path":"\/glossary\/imap\/"},{"objectID":"481","title":"IP Address","content":"IP Address","excerpt":"IP Address","path":"\/glossary\/ip-address\/"},{"objectID":"483","title":"Labels","content":"Labels","excerpt":"Labels","path":"\/glossary\/labels\/"},{"objectID":"485","title":"Labs","content":"Labs","excerpt":"Labs","path":"\/glossary\/labs\/"},{"objectID":"487","title":"Locked Content","content":"Locked Content","excerpt":"Locked Content","path":"\/glossary\/locked-content\/"},{"objectID":"489","title":"Mail Delegation","content":"Mail Delegation","excerpt":"Mail Delegation","path":"\/glossary\/mail-delegation\/"},{"objectID":"491","title":"MX Record","content":"MX Record","excerpt":"MX Record","path":"\/glossary\/mx-record\/"},{"objectID":"493","title":"Message Security and Discovery","content":"Message Security and Discovery","excerpt":"Message Security and Discovery","path":"\/glossary\/message-security-and-discovery\/"},{"objectID":"495","title":"Message Security for Google Workspace","content":"Message Security for Google Workspace","excerpt":"Message Security for Google Workspace","path":"\/glossary\/message-security-for-google-workspace\/"},{"objectID":"497","title":"Nicknames","content":"Nicknames","excerpt":"Nicknames","path":"\/glossary\/nicknames\/"},{"objectID":"513","title":"Privileges","content":"Privileges","excerpt":"Privileges","path":"\/glossary\/privileges\/"},{"objectID":"515","title":"Provisioned User","content":"Provisioned User","excerpt":"Provisioned User","path":"\/glossary\/provisioned-user\/"},{"objectID":"517","title":"Publish Pages","content":"Publish Pages","excerpt":"Publish Pages","path":"\/glossary\/publish-pages\/"},{"objectID":"519","title":"Rapid release track","content":"Rapid release track","excerpt":"Rapid release track","path":"\/glossary\/rapid-release-track\/"},{"objectID":"499","title":"NS Record","content":"NS Record","excerpt":"NS Record","path":"\/glossary\/ns-record\/"},{"objectID":"501","title":"Offline Gmail","content":"Offline Gmail","excerpt":"Offline Gmail","path":"\/glossary\/offline-gmail\/"},{"objectID":"503","title":"Policy Management and Message Recovery","content":"Policy Management and Message Recovery","excerpt":"Policy Management and Message Recovery","path":"\/glossary\/policy-management-and-message-recovery\/"},{"objectID":"505","title":"POP","content":"POP","excerpt":"POP","path":"\/glossary\/pop\/"},{"objectID":"507","title":"Postini","content":"Postini","excerpt":"Postini","path":"\/glossary\/postini\/"},{"objectID":"509","title":"Primary Domain","content":"Primary Domain","excerpt":"Primary Domain","path":"\/glossary\/primary-domain\/"},{"objectID":"511","title":"Priority Inbox","content":"Priority Inbox","excerpt":"Priority Inbox","path":"\/glossary\/priority-inbox\/"},{"objectID":"521","title":"SaaS","content":"SaaS","excerpt":"SaaS","path":"\/glossary\/saas\/"},{"objectID":"523","title":"Scheduled release track","content":"Scheduled release track","excerpt":"Scheduled release track","path":"\/glossary\/scheduled-release-track\/"},{"objectID":"525","title":"Single Sign-on API","content":"Single Sign-on API","excerpt":"Single Sign-on API","path":"\/glossary\/single-sign-on-api\/"},{"objectID":"527","title":"Sites","content":"Sites","excerpt":"Sites","path":"\/glossary\/sites\/"},{"objectID":"529","title":"Smart hosting","content":"Smart hosting","excerpt":"Smart hosting","path":"\/glossary\/smart-hosting\/"},{"objectID":"531","title":"SMTP","content":"SMTP","excerpt":"SMTP","path":"\/glossary\/smtp\/"},{"objectID":"533","title":"SOA","content":"SOA","excerpt":"SOA","path":"\/glossary\/soa\/"},{"objectID":"535","title":"SPF","content":"SPF","excerpt":"SPF","path":"\/glossary\/spf\/"},{"objectID":"537","title":"Split delivery","content":"Split delivery","excerpt":"Split delivery","path":"\/glossary\/split-delivery\/"},{"objectID":"539","title":"SSL","content":"SSL","excerpt":"SSL","path":"\/glossary\/ssl\/"},{"objectID":"541","title":"Start Page","content":"Start Page","excerpt":"Start Page","path":"\/glossary\/start-page\/"},{"objectID":"543","title":"Start Page Editor","content":"Start Page Editor","excerpt":"Start Page Editor","path":"\/glossary\/start-page-editor\/"},{"objectID":"545","title":"Subdomain","content":"Subdomain","excerpt":"Subdomain","path":"\/glossary\/subdomain\/"},{"objectID":"547","title":"Super Administrator Account","content":"Super Administrator Account","excerpt":"Super Administrator Account","path":"\/glossary\/super-administrator-account\/"},{"objectID":"549","title":"Temporary E-mail Address","content":"Temporary E-mail Address","excerpt":"Temporary E-mail Address","path":"\/glossary\/temporary-e-mail-address\/"},{"objectID":"551","title":"Templates","content":"Templates","excerpt":"Templates","path":"\/glossary\/templates\/"},{"objectID":"553","title":"TLS","content":"TLS","excerpt":"TLS","path":"\/glossary\/tls\/"},{"objectID":"555","title":"TLS compliance routing","content":"TLS compliance routing","excerpt":"TLS compliance routing","path":"\/glossary\/tls-compliance-routing\/"},{"objectID":"557","title":"Transfer Token","content":"Transfer Token","excerpt":"Transfer Token","path":"\/glossary\/transfer-token\/"},{"objectID":"559","title":"TXT Record","content":"TXT Record","excerpt":"TXT Record","path":"\/glossary\/txt-record\/"},{"objectID":"561","title":"URL","content":"URL","excerpt":"URL","path":"\/glossary\/url\/"},{"objectID":"563","title":"User-customizable Columns","content":"User-customizable Columns","excerpt":"User-customizable Columns","path":"\/glossary\/user-customizable-columns\/"},{"objectID":"565","title":"Username","content":"Username","excerpt":"Username","path":"\/glossary\/username\/"},{"objectID":"567","title":"User E-mail Uploads","content":"User E-mail Uploads","excerpt":"User E-mail Uploads","path":"\/glossary\/user-e-mail-uploads\/"},{"objectID":"569","title":"Video","content":"Video","excerpt":"Video","path":"\/glossary\/video\/"},{"objectID":"571","title":"Warning Message","content":"Warning Message","excerpt":"Warning Message","path":"\/glossary\/warning-message\/"},{"objectID":"573","title":"Web Publishing Address","content":"Web Publishing Address","excerpt":"Web Publishing Address","path":"\/glossary\/web-publishing-address\/"},{"objectID":"575","title":"WHOIS","content":"WHOIS","excerpt":"WHOIS","path":"\/glossary\/whois\/"},{"objectID":"101","title":"Recent Posts","content":"Recent Posts        \n                \n                    \n                 \n  \n    \n      \n      \n      \n      \n\t\tNovember 24, 2014\t  \n      \n\t\n  \n\tTerabyte of free storage with Chromebooks\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tWe love our Chromebooks, and now there's another reason to buy one:&nbsp;How about one terabyte of free storage?\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tNovember 6, 2014\t  \n      \n\t\n  \n\tMeet your new inbox\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tMeet your new inbox. If you have a gmail account you can try it.\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 14, 2014\t  \n      \n\t\n  \n\tNew tool to analyze Gmail\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tThere's a fairly new tool available that will help you analyze your connections to people via Gmail. It's definitely worth trying this\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tSeptember 13, 2014\t  \n      \n\t\n  \n\tVoice, text &#038; video continue to converge\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tWith the promise of unified communication, voice, text &amp; video continue to converge. Google's platform has included Google Voice since it bought Grand Central in 2007. In 2013, Google announced a new unified messaging tool called Hangouts, which include voice, text and video calls. The newest update to Hangouts\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tAugust 9, 2014\t  \n      \n\t\n  \n\tEdit Microsoft Office files in Google Docs, Sheets, &#038; Slides\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tIf you have the new Google Drive, you may now edit Microsoft Office files natively in Google Drive and Gmail:\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tAugust 9, 2014\t  \n      \n\t\n  \n\tNew bulk mail spam filter\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tGmail does a great job removing spam from your inbox, but if you need even more filtering there's a new option:\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tJune 22, 2014\t  \n      \n\t\n  \n\tReimagine how your team works\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tReimagine how your team works\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tJune 16, 2014\t  \n      \n\t\n  \n\tGoogle+ Profile or Page?\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tWhich is better on Google+, a personal profile or a business page? This is a common question. If you own a business (as opposed to a professional practice) you will want a business page. Here's why:\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tJune 6, 2014\t  \n      \n\t\n  \n\teasyG Cloud.com Becomes a Google Workspace Premier Partner\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t&nbsp; EasyG Apps.com Becomes a Google Apps Premier Partner June 6, 2014 -- EasyG Apps.com announced it has become a Premier Partner of the Google Apps for Work™ suite of communication and collaboration tools.\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tMay 2, 2014\t  \n      \n\t\n  \n\tKing of Docs Shortcuts\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tIf you're like most people, you use perhaps 15% of the features of Microsoft Word. If you're using Google Docs, there's a great way to learn to use more features.\n\t\n\n\tRead More\n\n            \n                        \n                &laquo; Previous\n1\n2\n3\n4\n5\n6\n&hellip;\n10\nNext &raquo;","excerpt":"Recent Posts November 24, 2014 Terabyte of free storage with Chromebooks easyG We love our Chromebooks, and now there's another..","path":"\/blog\/page\/4\/"},{"objectID":"89","title":"Recent Posts","content":"Recent Posts        \n                \n                    \n                 \n  \n    \n      \n      \n      \n      \n\t\tApril 21, 2014\t  \n      \n\t\n  \n\tVan Teal evolves from Novell Groupwise to Google Apps for Business\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tApril 21, 2014\t  \n      \n\t\n  \n\tBrittex Appraisal Services streamlines workflow with Google Apps for Business\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tApril 21, 2014\t  \n      \n\t\n  \n\tEmail Inbox Type\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t&nbsp; What's your email inbox type? Many people are uncomfortable with their inbox. Most use Outlook or Google mail. Both list messages in the order received, but there's a better way!\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tApril 1, 2014\t  \n      \n\t\n  \n\tPain free conference calls\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tPain Free Conference Calls Schedule conferences that call people Participants simply receive the call&nbsp; Powerful web interface shows&nbsp;who's speaking&nbsp; Share your screen and your files Relax &amp; enjoy high definition audio Free Trial Codes Available\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tDecember 13, 2013\t  \n      \n\t\n  \n\tMore Tips from Google\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tGoogle just published a new source of basic tips for their services\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 31, 2013\t  \n      \n\t\n  \n\tStart using Google Chrome Browser\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tGoogle's Chrome browser is the fastest, safest and most stable browser for Microsoft Windows and Macintosh operating systems. It's free and easy to try.\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 8, 2013\t  \n      \n\t\n  \n\tShare Google Drive files with people who do not have a Google Account\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tFinally, Google Drive has been updated to allow you to share files with people who do not have a Google Account!\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tSeptember 20, 2013\t  \n      \n\t\n  \n\tShare Drive files with Circles\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tAs Google users evolve from Gmail to Google+, file sharing is evolving too. To learn how to share Google Drive files with your Google+ Circles,\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tSeptember 19, 2013\t  \n      \n\t\n  \n\tArchive or delete\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tIs your inbox out of control? Do you spend much time deleting messages? One of the most basic solutions is to start archiving and stop deleting. Archiving is faster because you don't have to decide if you will ever need to review the message. To learn more about archiving your messages:\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tSeptember 11, 2013\t  \n      \n\t\n  \n\tAlternate row shading in Google sheets\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tEver tried to create alternate row shading in a Google sheet? It's easy if you know how\n\t\n\n\tRead More\n\n            \n                        \n                &laquo; Previous\n1\n&hellip;\n3\n4\n5\n6\n7\n&hellip;\n10\nNext &raquo;","excerpt":"Recent Posts April 21, 2014 Van Teal evolves from Novell Groupwise to Google Apps for Business easyG Read More April..","path":"\/blog\/page\/5\/"},{"objectID":"66","title":"Recent Posts","content":"Recent Posts        \n                \n                    \n                 \n  \n    \n      \n      \n      \n      \n\t\tNovember 17, 2011\t  \n      \n\t\n  \n\tHangout video meeting\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tHangout Video Meeting Meet with up to 25 people or stream live to the world!\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tNovember 17, 2011\t  \n      \n\t\n  \n\tGmail Advanced Search\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tGmail Advanced Search\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tNovember 17, 2011\t  \n      \n\t\n  \n\tGoing Google\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tGoing Google\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tNovember 17, 2011\t  \n      \n\t\n  \n\tPriority Inbox\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tPriority Inbox &nbsp; What's your email inbox type? Many people are uncomfortable with their inbox. Most use Outlook or Google mail. Both list messages in the order received, but there's a better way! Want to see your important messages first? The same service that powers the world's best spam filter can also help&nbsp;organize you. The [&hellip;]\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tNovember 17, 2011\t  \n      \n\t\n  \n\tGoogle Cloud Security\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tGoogle Security\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tNovember 17, 2011\t  \n      \n\t\n  \n\tGroup Collaborative Inbox\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tGroup Collaborative Inbox\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tNovember 17, 2011\t  \n      \n\t\n  \n\tWhat its like Going Google\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tWhat it's like going Google\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tNovember 17, 2011\t  \n      \n\t\n  \n\tManage Mobile Users\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tManage Mobile Users\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tNovember 17, 2011\t  \n      \n\t\n  \n\tWork Smarter\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tWork Smarter with G Suite\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tNovember 13, 2011\t  \n      \n\t\n  \n\tSite Map\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tPlease check back soon for our new Sitemap.\n\t\n\n\tRead More\n\n            \n                        \n                &laquo; Previous\n1\n&hellip;\n7\n8\n9\n10\nNext &raquo;","excerpt":"Recent Posts November 17, 2011 Hangout video meeting easyG Hangout Video Meeting Meet with up to 25 people or stream..","path":"\/blog\/page\/9\/"},{"objectID":"44","title":"Recent Posts","content":"Recent Posts        \n                \n                    \n                 \n  \n    \n      \n      \n      \n      \n\t\tJuly 27, 2012\t  \n      \n\t\n  \n\tAutomatic deletion of file versions\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tAutomatic deletion of file versions Traditionally we were taught to back up, back up, back up our files. Fortunately, with Google Apps, everything is backed up for us. The result can be a huge number of file versions, some of which may be safely deleted. Google Drive greatly simplifies version control, and to make more [&hellip;]\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tJuly 21, 2012\t  \n      \n\t\n  \n\tGoogle Drive for iOS\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tIt may surprise you to know that many of Google's employees don't use Microsoft Windows, they use Apple's Macintosh computers. For those of you who want to use Google Drive but love your iPhone, a new solution was released June 28 2012.&nbsp;\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tJuly 6, 2012\t  \n      \n\t\n  \n\tGoogle Apps Tips and Tricks\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tG Suite Tips and Tricks\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tJuly 3, 2012\t  \n      \n\t\n  \n\tJelly Bean Search Video\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tAs more and more computing is done from mobile phones, the ability to skip the keyboard by using your voice to interact with your mobile tools is becoming more and more important. I used to be jealous of Apple's Siri,\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tJune 29, 2012\t  \n      \n\t\n  \n\tWorld's most powerful tool\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tHow would you like to learn to better use the most powerful tool in the world?&nbsp;You may already be familiar with some shortcuts for Google Search,\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tMay 1, 2012\t  \n      \n\t\n  \n\tGoogle Vault\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tGoogle has announced [and is deploying] Google Vault. What is it?\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tApril 25, 2012\t  \n      \n\t\n  \n\tGoogle Drive\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tGoogle has finally announced [and is deploying] Google Drive. What is it?\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tNovember 17, 2011\t  \n      \n\t\n  \n\tExplore a Google Data Center\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tExplore a Google Data Center\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tNovember 17, 2011\t  \n      \n\t\n  \n\tUse Forms in Google Drive\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tUse Forms in Google Drive\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tNovember 17, 2011\t  \n      \n\t\n  \n\tInbox Zero\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tTips for getting to inbox zero\n\t\n\n\tRead More\n\n            \n                        \n                &laquo; Previous\n1\n&hellip;\n6\n7\n8\n9\n10\nNext &raquo;","excerpt":"Recent Posts July 27, 2012 Automatic deletion of file versions easyG Automatic deletion of file versions Traditionally we were taught..","path":"\/blog\/page\/8\/"},{"objectID":"309","title":"Glossary","content":"Glossary\n\n\n\nCustom URL\nCustom URLs, or short URLs, make using the Internet easier. You and your users can access services with a simple, easy-to-remember address. Your custom URLs will follow this format: http:\/\/[customize this section].your_domain.com, and redirect to a login page.\n\n\n\nDirect delivery\nBy default, Google Workspace mail servers deliver incoming mail to the Gmail inbox of the recipient. If a message is addressed to a user in your domain that is not registered in Google Workspace, the mail server discards the message.\n\n\n\nDKIM\nIs an acronym for \"DomainKeys Identified Mail\". It is a method for associating a domain name with an e-mail, thereby allowing an organization to take responsibility for a message in a way that can be validated by a recipient. The validation technique is based on public-key cryptography.\n\n\n\nDMARC\nIs an acronym for \"Domain-based Message Authentication, Reporting &amp; Conformance\". It is a technical standard that&nbsp;helps protect email senders and recipients from spam, spoofing, and phishing. A DMARC policy is published to request feedback from receiving email servers and to tell them what to do with messages that are not authenticated by the sending domain. DMARC builds upon both the DomainKeys Identified Mail (DKIM) and Sender Policy Framework (SPF) specifications.&nbsp;Policies include \"none\", \"quarantine\", or \"reject\".\n&nbsp;\n\n\n\nDNS\nIs an acronym for \"Domain Name System\". DNS is a hierarchical distributed database that lets you store IP addresses and other data and look it up by name. This is the system that organizes and identifies domains. DNS is the \"phone book\" of the web. While a phone book translates a name like &ldquo;Acme Pizza&rdquo; into the right phone number to call, the DNS translates a URL (like \"http:\/\/EasygCloud.com\") into an IP address (like &ldquo;74.125.239.137&rdquo;). For some Google Workspace functionality, you need to adjust DNS records of your domain. For example, DNS is used to determine where to deliver email for your domain via mail exchange (MX) records.\n\n\n\nDomain Alias\nDomain aliases are additional domain names associated with your primary domain. You can add a domain alias that receives mail and delivers it to mailboxes at your primary domain. See Basic Guide to DNS\n\n\n\nDomain Host\nDomain hosts run DNS servers for your domain. This includes A records, MX records, and CNAME records. See Basic Guide to DNS\n\n\n\nDomain Name\nDomain names are easy-to-remember names (ex. blueshirt.com or organicfood.org) that are associated with one or more IP addresses. Since a web page is defined by its URL, the page can move to a different IP address without affecting visitors. See Basic Guide to DNS\n\n\n\nDomain Ownership\nAccrues to the person or organization who registered the domain. For verification purposes administrators will be asked to prove that they own the domain name associated with a Google Workspace account.\n\n\n\nDomain Registrar\nDomain registrars sell Internet domain names (ex. blueshirt.com or organicfood.org ). Most of these companies offer a hosting service in addition to registration. See Basic Guide to DNS\n\n                    \n                                            \n                                        \n                        \n                            &laquo; Previous\n1\n2\n3\n4\n5\n6\n&hellip;\n14\nNext &raquo;","excerpt":"Glossary Custom URL Custom URLs, or short URLs, make using the Internet easier. You and your users can access services..","path":"\/glossary-terms\/page\/4\/"},{"objectID":"309","title":"Glossary","content":"Glossary\n\n\n\nDomain Registration\nThe process of registering Internet domain names with an accredited domain name registrar such as GoDaddy or eNom. Most registrars provide access to management of DNS records which is a requirement for use of Google Workspace.\n\n\n\nDual delivery \/ multiple delivery\nRoute messages to both a primary mail server and at least one additional, or secondary, mail server.\n\n\n\nEasy\nWithout difficulty or effort.\n\n\n\nEmail Migration\nA feature that helps domain administrators to transfer the existing contents of users' mailboxes from an outside source to Google Workspace. Server side tools are available for Google Workspace basic, Google Workspace business and Google Workspace for Education only.\n\n\n\nEmail Routing\nA feature that provides more flexibility with messages addressed to your domain. You can enable email routing for your entire domain or certain user accounts. Google Workspace for Business and Education only.\n\n\n\nEmail Whitelist\nAn email whitelist is a list of contacts that you deem are acceptable for sending mail to your domain and should not be labeled as spam. Google Workspace only.\n\n\n\nFilters\nA Gmail feature that allows you to manage the flow of incoming messages automatically! Creating a filter consists of two steps, 1) Identify specific message criteria, and 2) Select specific actions to take based on that criteria.\n\n\n\nForm\nYou can create a form from the Docs list or from any spreadsheet.\n\n\n\nFull Header\nA full header contains information about the transfer of a message over the Internet. Typical message header fields include sender, recipient, subject, date, and server information.\n\n\n\nGoogle\nA verb that means \"to search on the Internet\". Larry Page and Sergey Brin, the founders of Google, named their search engine after the term googol. In 1997, Larry was brainstorming names with other Stanford graduate students, including Sean Anderson, and looking at available domain names. Anderson miskeyed googol as \"google\" and found it available. Larry liked it and the name \"Google\" stuck.\n\n                    \n                                            \n                                        \n                        \n                            &laquo; Previous\n1\n&hellip;\n3\n4\n5\n6\n7\n&hellip;\n14\nNext &raquo;","excerpt":"Glossary Domain Registration The process of registering Internet domain names with an accredited domain name registrar such as GoDaddy or..","path":"\/glossary-terms\/page\/5\/"},{"objectID":"309","title":"Glossary","content":"Glossary\n\n\n\nTLS\nIs an acronym for \"Transport Layer Security\". TLS and its predecessor, Secure Sockets Layer (SSL), are cryptographic protocols that provide communication security over the Internet.\n\n\n\nTLS compliance routing\nRequire an encrypted connection when corresponding with specific domains or recipients.\n\n\n\nTransfer Token\nA special token (https:\/\/admin.google.com\/TransferToken) which allows you to transfer the management of your Google Workspace account to a new Google Cloud Partner. Log in to your account prior to generating the token. Once you authenticate with a valid super administrator username and password, a token is generated. Give the token's alphanumeric code to your new Google Partner, which completes the transfer. There is no charge for transfers, however your Company may remain liable to pay Google for the remaining balance of your contract, depending on who you speak with at Google.\n\n\n\nTXT Record\nText or TXT records may contain arbitrary text but can also be used to define machine readable text. TXT records are used primarily with Google Workspace for domain ownership verification purposes. Also, you&rsquo;ll need to use TXT records to implement email abuse prevention methods such as SPF, DKIM, and DMARC.\n\n\n\nURL\nIs an acronym for \"Uniform Resource Locator\". This is the address of a resource on the Internet. For example, the URL of this page is&nbsp;http:\/\/easygcloud.com\/glossary.\n\n\n\nUser E-mail Uploads\nUsers can migrate e-mail from their old accounts into Google Workspace e-mail using the Email Migration API. If administrators prefer to manage the email migration for their domain, they can disable this feature in the&nbsp;admin console.\n\n\n\nUser-customizable Columns\nUnlocked modules of the start page where users to add content, such as Google Gadgets.\n\n\n\nUsername\nA username is the name a user enters when logging in to Google Workspace services. A user's email address is his or her username followed by @domain.com.\n\n\n\nVideo\nSee Google Video for business.\n\n\n\nWarning Message\nTo protect information that's critical to your organization, you can enable a warning message each time a user communicates or shares information via calendar, documents &amp; spreadsheets, and chat.\n\n                    \n                                            \n                                        \n                        \n                            &laquo; Previous\n1\n&hellip;\n11\n12\n13\n14\nNext &raquo;","excerpt":"Glossary TLS Is an acronym for \"Transport Layer Security\". TLS and its predecessor, Secure Sockets Layer (SSL), are cryptographic protocols..","path":"\/glossary-terms\/page\/13\/"},{"objectID":"309","title":"Glossary","content":"Glossary\n\n\n\nSPF\nIs an acronym for \"Sender Policy Framework\". It's an open standard specifying a technical method to prevent sender address forgery.\n\n\n\nSplit delivery\nIf you have unregistered Google Workspace users, you can route those users to an on-premise mail server. You can also set up split delivery for registered users in different organizational units.\n\n\n\nSSL\nIs an acronym for \"Secure Sockets Layer\". It's a cryptographic protocol that provides communication security over the Internet.\n\n\n\nStart Page\nA syndicated version of iGoogle, allowing you to set up a dynamic homepage for your users that brings together your content, Google services, and the best of the web.\n\n\n\nStart Page Editor\nAllows you to edit the color, layout, and default content of your start page.\n\n\n\nStatus DashboardDisplays performance information for Google Workspace services: google.com\/appsstatus\n\n\n\nSubdomain\nA subdomain is a part of a larger domain. For example,&nbsp;www.EasygCloud.com&nbsp;is a subdomain of&nbsp;http:\/\/EasygCloud.com.\n\n\n\nSuper Administrator Account\nA super administrator has complete access to the Google Workspace administrator console, and can assign administrators with restricted access to specific sections of the admin console. See Administrator privileges for details about which administrator actions are available from each admin console&nbsp;section.\n\n\n\nTemplates\nA number of templates available for docs in our template gallery.\n\n\n\nTemporary E-mail Address\nAssigned to all user accounts once domain ownership has been verified. This allows you to test sending and receiving mail before changing your domain's MX records.\n\n                    \n                                            \n                                        \n                        \n                            &laquo; Previous\n1\n&hellip;\n10\n11\n12\n13\n14\nNext &raquo;","excerpt":"Glossary SPF Is an acronym for \"Sender Policy Framework\". It's an open standard specifying a technical method to prevent sender..","path":"\/glossary-terms\/page\/12\/"},{"objectID":"557","title":"Recent Posts","content":"Recent Posts        \n                \n                    \n                 \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tTransfer Token\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tTLS compliance routing\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tTLS\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tTemplates\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tTemporary E-mail Address\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tSuper Administrator Account\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tSubdomain\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tStart Page Editor\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tStart Page\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tSSL\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n            \n                        \n                &laquo; Previous\n1\n2\n3\n4\n&hellip;\n14\nNext &raquo;","excerpt":"Recent Posts October 19, 2022 Transfer Token easyG Read More October 19, 2022 TLS compliance routing easyG Read More October..","path":"\/glossary\/page\/2\/"},{"objectID":"537","title":"Recent Posts","content":"Recent Posts        \n                \n                    \n                 \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tSplit delivery\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tSPF\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tSOA\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tSMTP\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tSmart hosting\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tSites\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tSingle Sign-on API\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tScheduled release track\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tSaaS\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tRapid release track\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n            \n                        \n                &laquo; Previous\n1\n2\n3\n4\n5\n&hellip;\n14\nNext &raquo;","excerpt":"Recent Posts October 19, 2022 Split delivery easyG Read More October 19, 2022 SPF easyG Read More October 19, 2022..","path":"\/glossary\/page\/3\/"},{"objectID":"306","title":"Recent Posts","content":"Recent Posts        \n                \n                    \n                 \n  \n    \n      \n      \n      \n      \n\t\tOctober 17, 2022\t  \n      \n\t\n  \n\tAccount Type\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 17, 2022\t  \n      \n\t\n  \n\tAbuse\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tAbuse is a reserved username and Google monitors abuse@yourdomain.com.\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 17, 2022\t  \n      \n\t\n  \n\tA Record\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tAddress or A records (also known as host records) are the central records of DNS. These records link a domain to an IP address. You need A records if you want to forward your naked domain in Google Workspace.\n\t\n\n\tRead More\n\n            \n                        \n                &laquo; Previous\n1\n&hellip;\n12\n13\n14","excerpt":"Recent Posts October 17, 2022 Account Type easyG Read More October 17, 2022 Abuse easyG Abuse is a reserved username..","path":"\/glossary\/page\/14\/"},{"objectID":"78","title":"Recent Posts","content":"Recent Posts        \n                \n                    \n                 \n  \n    \n      \n      \n      \n      \n\t\tAugust 30, 2013\t  \n      \n\t\n  \n\tTransfer Google+ connections between accounts\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tIf you have ever wanted to transfer Google+ connections between accounts, this tip is for you.\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tAugust 1, 2013\t  \n      \n\t\n  \n\tChrome Remote Desktop\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tHere's an easy way to share your screen remotely, or help someone who shares their screen with you. Both users must be using Google's Chrome browser\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tJune 23, 2013\t  \n      \n\t\n  \n\tEverything you always wanted to know about Google Apps\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tEverything you want to know about Google Apps but were afraid to ask; an interview with Martin Shervington &amp; Douglas Baumwall\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tJune 9, 2013\t  \n      \n\t\n  \n\tGoogle Apps for Business Case Studies\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tWhy do Companies go Google? Here are some case studies that show several different kinds of businesses that have gone Google so you can see and hear exactly why...\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tJune 9, 2013\t  \n      \n\t\n  \n\tGoogle Workspace Case Studies\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tG Suite Case Studies\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tJune 2, 2013\t  \n      \n\t\n  \n\tRemember 2012\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tBetter late than never, here's a great video to remember 2012\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tMay 9, 2013\t  \n      \n\t\n  \n\tAre you in inbox purgatory\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tIf SPAM is hell and inbox zero is heaven, what are you doing in purgatory?\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tMay 2, 2013\t  \n      \n\t\n  \n\tGoogle Keep is a brand new App\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tMy last post was about Google Keep, which was available as a web page. Less than a month later, it's now available as an App.\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tMarch 20, 2013\t  \n      \n\t\n  \n\tGoogle Keep\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tYears ago I experimented with a service called Evernote. It was supposed to be a repository for everything I wanted to remember. It seemed like a good idea, but I eventually began using Google Drive instead. Today, Google announced a new service which makes Google Drive more useful. It's a way to get notes, dictation [&hellip;]\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tDecember 5, 2012\t  \n      \n\t\n  \n\tNew Gmail App for iPhone\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tiPhone users rejoice; there's a new Gmail app just for you.\n\t\n\n\tRead More\n\n            \n                        \n                &laquo; Previous\n1\n&hellip;\n4\n5\n6\n7\n8\n&hellip;\n10\nNext &raquo;","excerpt":"Recent Posts August 30, 2013 Transfer Google+ connections between accounts easyG If you have ever wanted to transfer Google+ connections..","path":"\/blog\/page\/6\/"},{"objectID":"63","title":"Recent Posts","content":"Recent Posts        \n                \n                    \n                 \n  \n    \n      \n      \n      \n      \n\t\tNovember 21, 2012\t  \n      \n\t\n  \n\tLife after 25GB\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tApps for Business includes 25GB of Gmail archive. If you're starting to run out of space, one way to address this issue is to delete some of your largest attachments.\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tNovember 14, 2012\t  \n      \n\t\n  \n\tSearch for email by size in Gmail\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tFinally! You can now search for email messages by size in Gmail\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tNovember 8, 2012\t  \n      \n\t\n  \n\tChrome is always getting faster\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tGoogle Chrome is our favorite browser. It's faster, safer, easier to use, and has a nice clean look. A clean graphical user interface is part of Google's brand. Every six weeks, you get a brand new browser.&nbsp;\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tNovember 5, 2012\t  \n      \n\t\n  \n\tHurricane Sandy Discount\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tHurricane Sandy emergency assistance program for small and mid-size businesses impacted by the storm.\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 31, 2012\t  \n      \n\t\n  \n\tOctober 2012 Newsletter\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tOctober is almost over. Here's our October Newsletter\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 1, 2012\t  \n      \n\t\n  \n\tGoogle for Entrepreneurs\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tGoogle has announced a new initiative, Google for Entrepreneurs, designed to foster the spirit of entrepreneurship worldwide by supporting entrepreneurs in local communities. The initiative will serve as the umbrella for several dozen programs and partnerships involving Google that support startups and entrepreneurs. For more on these existing programs and to stay connected on upcoming [&hellip;]\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 1, 2012\t  \n      \n\t\n  \n\tFraternity Goes Google\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tInternational Fraternity Alpha Epsilon Pi Goes Google With almost 100,000 E-mail messages at risk&nbsp;on an aging server, AEPi went live with Google Apps today, unifying staff and volunteers while reducing their risk and budget\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tSeptember 1, 2012\t  \n      \n\t\n  \n\tNewsletter August 2012\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tThis week, Google launched the first set of Google+ features designed specifically for the enterprise. What launched? The features launched begin to address the top requests from our partners and customers, including more ways to control the content employees post and more ways to make Hangouts great for productive meetings from anywhere. You can preview\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tSeptember 1, 2012\t  \n      \n\t\n  \n\tNewsletter August 2012\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t{GoogleDoc docid=\"https:\/\/docs.google.com\/a\/easygapps.com\/document\/d\/1y7qoy-abuowCBjBE7GwWLaetsgD8fbE3rI5RgGhKyO4\/preview\" type=\"doc\" size=\"l\" frameborder=\"0\"}\n\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tJuly 31, 2012\t  \n      \n\t\n  \n\tGoogle Docs Demonstration\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\tHere’s a fun “Docs Demo: Masters Edition” that allows you to experience collaborating with famous authors.\n\t\n\n\tRead More\n\n            \n                        \n                &laquo; Previous\n1\n&hellip;\n5\n6\n7\n8\n9\n10\nNext &raquo;","excerpt":"Recent Posts November 21, 2012 Life after 25GB easyG Apps for Business includes 25GB of Gmail archive. If you're starting..","path":"\/blog\/page\/7\/"},{"objectID":"309","title":"Glossary","content":"Glossary\n\n\n\nGoogle Account\nA free account that provides access to many Google products. You need a Google Account to sign up for Google Workspace. Google accounts require an email address. Any email address, including but not necessarily a Gmail address, will work.\n\n\n\nGoogle App Engine\nGoogle's application development and hosting platform. It lets you build high traffic web applications without having to manage high traffic infrastructure.\n\n\n\nGoogle Apps (legacy free edition)\nDiscontinued 12\/6\/2012.\n\n\n\nGoogle Calendar\nA web-based calendar application that enables employees to work together efficiently and helps minimize costs and IT hassles.\n\n\n\nGoogle Certified Deployment Specialist\nTrusted Google partners which have been authorized to help organizations adopt the Google Workspace web based tools, replacing existing legacy systems and IT infrastructure.\n\n\n\nGoogle Certified Sales Specialist\nTrusted Google partners which have been authorized to help organizations adopt the Google Workspace web based tools, replacing existing legacy systems and IT infrastructure.\n\n\n\nGoogle Cloud Partner\nThe Google Cloud Partner Program gives qualified Companies with Certified and Credentialed Technicians the authority to sell Google Cloud, Google Workspace and related services like setup, implementation, migration, training, support, and organizational change management.\n\n\n\nGoogle Cloud Partners\nTrusted Companies that employ certified technicians and that are authorized to help organizations adopt Google Workspace web based tools, replacing existing legacy systems and IT infrastructure.\n\n\n\nGoogle Docs\nWeb-based documents, spreadsheets, drawings and presentations that let users edit the same file at the same time so you always have the latest version.\n\n\n\nGoogle Gadgets\nMini-applications that can be displayed on your personalised start page to show dynamic content. Examples: currency converter, translator, stock quotes, word of the day, or news feeds.\n\n                    \n                                            \n                                        \n                        \n                            &laquo; Previous\n1\n&hellip;\n4\n5\n6\n7\n8\n&hellip;\n14\nNext &raquo;","excerpt":"Glossary Google Account A free account that provides access to many Google products. You need a Google Account to sign..","path":"\/glossary-terms\/page\/6\/"},{"objectID":"309","title":"Glossary","content":"Glossary\n\n\n\nGoogle Groups\nAn administrative feature to manage team communications and sharing (formerly email lists).&nbsp;Learn more.\n\n\n\nGoogle Hangout\nRebranded to Google Chat and Google Meet and integrated into Google Workspace.\n\n\n\nGoogle Mail\nAlso known as Gmail, is the core of Google Workspace. It's a free, advertising-supported email service provided by Google. Users may access Gmail as secure webmail,[1] as well via POP3 or IMAP protocols.[2][3] Gmail was launched as an invitation-only beta release on April 1, 2004[4] and it became available to the general public on February 7, 2007, though still in beta status at that time.[5] The service was upgraded from beta status on July 7, 2009, along with the rest of the Google Workspace.[6][7] With an initial storage capacity offer of 1 GB per user, Gmail significantly increased the webmail standard for free storage from the 2 to 4 MBits competitors such as Hotmail offered at that time.[8] Individual Gmail messages, including attachments, may be up to 25 MB,[9] which is larger than many other mail services support. Gmail has a search-oriented interface and a \"conversation view\" similar to an Internet forum. Gmail is noted by web developers for its pioneering use of AJAX.[10] Gmail runs on Google GFE\/2.0 on Linux.[11][12][13]\n\n\n\nGoogle Plus\nSee Google+\n\n\n\nGoogle Sites\nGoogle Sites is an easy way to create secure web pages for intranets and team projects. No coding or HTML required.\n\n\n\nGoogle Talk Client\nGoogle Talk is a downloadable Windows application that enables users to quickly and easily chat, voice call, and file transfer for free. Calls are made through your computer using the latest voice technology; all you need is an Internet connection, a microphone and a speaker.\n\n\n\nGoogle Video for Business\nA video hosting and sharing solution for enterprises.\n\n\n\nGoogle Voice and Voice and Video Chat Plugin\nRequired to use Google Hangouts features and is loaded by Chrome automatically.\n\n\n\nGoogle Workspace (formerly G Suite) plans\nCurrently there are five commercial pricing plans offered: Business Starter, Business Standard, Business Plus, Enterprise Standard and Enterprise Plus.\n\n\n\nGoogle Workspace Migration\nThe process of transferring email, contacts, documents, calendars, archives, etc. from a legacy system to Google Workspace.\n\n                    \n                                            \n                                        \n                        \n                            &laquo; Previous\n1\n&hellip;\n5\n6\n7\n8\n9\n&hellip;\n14\nNext &raquo;","excerpt":"Glossary Google Groups An administrative feature to manage team communications and sharing (formerly email lists).&nbsp;Learn more. Google Hangout Rebranded to..","path":"\/glossary-terms\/page\/7\/"},{"objectID":"309","title":"Glossary","content":"Glossary\n\n\n\nProvisioned User\nA user account that has been created in the Google Workspace admin console or via Google Workspace Directory Sync.\n\n\n\nPublish Pages\nWhen you create and edit your web pages, you need to publish or upload the page to the web so that it can be seen.\n\n\n\nRapid release track\nGoogle Workspace users receive new features and updates automatically, without needing to install or update software, however you can still control when new features become available for users. The rapid release track allows users to access new features as soon as Google rolls them out to consumer users. These features have been through testing and quality assurance, but users will see them at the same time administrators do, before administrators have a chance to evaluate them for their organization.\n\n\n\nSaaS\nIs an acronym for \"software as a service\". SaaS&nbsp;is a software distribution model in which software applications are hosted by a vendor or service provider and made available to customers over a network. It's software&nbsp;delivered on a pay-as-you-go basis as a utility (like electricity) over a network (typically the Internet).\n\n\n\nScheduled release track\nGoogle Workspace users receive new features and updates automatically, without needing to install or update software, however you can still control when new features become available for users. The scheduled release track&nbsp;delays the release of new features to users, giving administrators extra time to train support staff and prepare users for the coming changes. Google releases features to the scheduled release track on Tuesdays only, at least one week after the feature was released to the rapid release track.\n\n\n\nSingle Sign-on API\nSAML-based Single Sign-On (SSO) provides full control over the authorization and authentication of user accounts that access web based applications (like GMail or Calendar). Available to Google Workspace only.\n\n\n\nSites\nAn online application offered by Google Workspace that makes creating a team web site as easy as editing a document.&nbsp;Learn more.\n\n\n\nSmart hosting\nRoute outbound mail to an outbound mail gateway, which then delivers messages to the recipients.\n\n\n\nSMTP\nIs an acronym for \"Simple Mail Transfer Protocol\". It is an Internet standard for electronic mail (e-mail) transmission across Internet Protocol (IP) networks.\n\n\n\nSOA\nIs an acronym for \"Start of Authority\". Domain registration establishes SOA records in the DNS servers of the parent domain, indicating the IP address of authoritative DNS servers.\n\n                    \n                                            \n                                        \n                        \n                            &laquo; Previous\n1\n&hellip;\n9\n10\n11\n12\n13\n14\nNext &raquo;","excerpt":"Glossary Provisioned User A user account that has been created in the Google Workspace admin console or via Google Workspace..","path":"\/glossary-terms\/page\/11\/"},{"objectID":"309","title":"Glossary","content":"Glossary\n\n\n\nMX Record\nMail Exchange (MX) records direct email to servers for a domain. Multiple MX records can be defined for a domain, each with a different priority where the lowest number is the highest priority. If mail can't be delivered using the first priority record, the second priority record is used, and so on. To set up email with Google Workspace, you need to point your MX records to Google's mail servers.\n\n\n\nNicknames\nA nickname is a user's alternate email address. A nickname is not a username, and it is not a separate email account.\n\n\n\nNS Record\nName server (NS) records determine which servers will hold and communicate DNS information for a domain. Generally, you should have primary and secondary name server records for your domain. If using Google Workspace, you may configure NS records with your registrar or domain hosting service that point to Google servers for DNS queries.\n\n\n\nOffline Gmail\nGmail Offline beta is a Gmail app built to support offline access, allowing mail to be read, responded to, searched and archived without network access. After first start-up, Gmail Offline will automatically synchronize messages and queued actions anytime Chrome is running and an Internet connection is available. More than just an offline app, the streamlined user interface, based off Gmail&rsquo;s popular tablet interface, provides extremely fast response time with a pure, email focused experience.\n\n\n\nPolicy Management and Message Recovery\nThis is a legacy service originally provided by Postini to Google Workspace customers. This was made available only to customers who registered for Google Workspace before August 28, 2008. \"Message Security for Google Workspace\" is the new name.\n\n\n\nPOP\nAn acronym for \"Post Office Protocol\". An application-layer Internet standard protocol used by local e-mail clients to retrieve e-mail from a remote server over a TCP\/IP connection. POP and IMAP (Internet Message Access Protocol) are the two most prevalent Internet standard protocols for e-mail retrieval. Virtually all modern e-mail clients and servers support both. The POP protocol has been developed through several versions, with version 3 (POP3) being the current standard. Like IMAP, POP3 is supported by most webmail services such as Hotmail, Gmail and Yahoo! Mail.\n\n\n\nPostini\nAn email, web security and archiving Company Google bought in 2007. It provided cloud computing services for filtering out spam and malware&nbsp;prior to&nbsp;message delivery, and offered optional e-mail archiving. Most of Postini's&nbsp;features are now offered natively in Google Workspace, and Google stopped offering Postini&nbsp;in 2012.\n\n\n\nPrimary Domain\nRefers to the primary domain of your Google Workspace account. You can add domain aliases to your primary domain.\n\n\n\nPriority Inbox\nPriority Inbox can help save you time if you&rsquo;re overwhelmed with the amount of email you get. It attempts to automatically identify your important incoming messages and separates them from everything else. Gmail uses a variety of signals to prioritize your incoming messages, including who you&rsquo;ve emailed and chatted with most and which keywords appear frequently in the messages you opened recently.&nbsp;Learn more.\n\n\n\nPrivileges\nRefers to administration rights of an administrator to manage Google Workspace services for a domain.\n\n                    \n                                            \n                                        \n                        \n                            &laquo; Previous\n1\n&hellip;\n8\n9\n10\n11\n12\n&hellip;\n14\nNext &raquo;","excerpt":"Glossary MX Record Mail Exchange (MX) records direct email to servers for a domain. Multiple MX records can be defined..","path":"\/glossary-terms\/page\/10\/"},{"objectID":"517","title":"Recent Posts","content":"Recent Posts        \n                \n                    \n                 \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tPublish Pages\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tProvisioned User\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tPrivileges\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tPriority Inbox\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tPrimary Domain\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tPostini\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tPOP\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tPolicy Management and Message Recovery\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tOffline Gmail\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tNS Record\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n            \n                        \n                &laquo; Previous\n1\n2\n3\n4\n5\n6\n&hellip;\n14\nNext &raquo;","excerpt":"Recent Posts October 19, 2022 Publish Pages easyG Read More October 19, 2022 Provisioned User easyG Read More October 19,..","path":"\/glossary\/page\/4\/"},{"objectID":"497","title":"Recent Posts","content":"Recent Posts        \n                \n                    \n                 \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tNicknames\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tMessage Security for Google Workspace\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tMessage Security and Discovery\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tMX Record\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tMail Delegation\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tLocked Content\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tLabs\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tLabels\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tIP Address\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tIMAP\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n            \n                        \n                &laquo; Previous\n1\n&hellip;\n3\n4\n5\n6\n7\n&hellip;\n14\nNext &raquo;","excerpt":"Recent Posts October 19, 2022 Nicknames easyG Read More October 19, 2022 Message Security for Google Workspace easyG Read More..","path":"\/glossary\/page\/5\/"},{"objectID":"335","title":"Recent Posts","content":"Recent Posts        \n                \n                    \n                 \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tBIMI\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tAutomatic Renewal\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tAuto-forwarding\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tAttachment routing\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tArchive\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tStatus Dashboard\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tAPI\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tAlias\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tAdmin console\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tAdministrator Account\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n            \n                        \n                &laquo; Previous\n1\n&hellip;\n11\n12\n13\n14\nNext &raquo;","excerpt":"Recent Posts October 19, 2022 BIMI easyG Read More October 19, 2022 Automatic Renewal easyG Read More October 19, 2022..","path":"\/glossary\/page\/13\/"},{"objectID":"355","title":"Recent Posts","content":"Recent Posts        \n                \n                    \n                 \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tCloud computing\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tChromebook\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tChrome remote desktop\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tChrome browser\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tChat\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tCatch-all Address\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\t.CSV\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tBlogger Custom Domain\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tBulk Account Update\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tBrowser\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n            \n                        \n                &laquo; Previous\n1\n&hellip;\n10\n11\n12\n13\n14\nNext &raquo;","excerpt":"Recent Posts October 19, 2022 Cloud computing easyG Read More October 19, 2022 Chromebook easyG Read More October 19, 2022..","path":"\/glossary\/page\/12\/"},{"objectID":"309","title":"Glossary","content":"Glossary\n\n\n\nGoogle Workspace Migration for Lotus Notes\nComplete migration of mail, calendars, contacts, and group information from your Notes accounts to Google Apps.\n\n\n\nGoogle Workspace Migration for Microsoft Exchange\nComplete migration of email, contacts, calendars, and files from your Microsoft 365 accounts to Google Workspace accounts.\n\n\n\nGoogle Workspace Migration for Microsoft Outlook\nComplete migration of mail, calendars, and contacts from your Outlook account to Google Apps.\n\n\n\nGoogle Workspace Migration for Novell GroupWise\nComplete migration of mail, calendars, contacts, and group information from your GroupWise accounts to Google Apps.\n\n\n\nGoogle+\nDeprecated\n\n\n\nGooglePlex\nGoogle's corporate headquarters is called the GooglePlex, an affectionately tongue-in-cheek reference to the origins of the company name.\n\n\n\nGoogol\nA googol is a very large number; the digit 1 followed by one hundred zeros. The term was coined in 1938 by 9-year-old Milton Sirotta (1929&ndash;1981), nephew of American mathematician Edward Kasner. Kasner popularized the concept in his book Mathematics and the Imagination (1940).\n\n\n\nGoogolplex\nAnother mathematician devised the term googolplex for 10 to the power of googol - that is, 1 followed by 10 to the power of 100 zeros. Frank Pilhofer has determined that, given Moore's Law (which is that computer processor power doubles about every 1 to 2 years), it would make no sense to try to print out a googolplex until the year 2530 since all earlier attempts to print a googolplex would be overtaken by a faster computer processor.\n\n\n\nHangouts\nDeprecated - Google+ Hangouts is a communication service that replaced Google Talk, Chat in Gmail, and Google+ Messenger to create a better experience to send messages, photos and make group video calls. Hangouts is available in Gmail, Google+, on iOS or Android device, and as a Chrome extension. Hangouts is turned OFF by default for Google Workspace. Domain admins must opt-in via the admin console. After opting in, Admins can choose to opt out for the domain or for organizational units within it whenever they want. IMPORTANT: Domains that have opted-in to Google+ Hangouts cannot purchase Google Workspace Vault and you should not opt in if you plan to purchase Vault. Domains that have purchased Vault or are under data location restrictions will not be able to opt-in.\n\n\n\nHeaders\nSee full header.\n\n                    \n                                            \n                                        \n                        \n                            &laquo; Previous\n1\n&hellip;\n6\n7\n8\n9\n10\n&hellip;\n14\nNext &raquo;","excerpt":"Glossary Google Workspace Migration for Lotus Notes Complete migration of mail, calendars, contacts, and group information from your Notes accounts..","path":"\/glossary-terms\/page\/8\/"},{"objectID":"309","title":"Glossary","content":"Glossary\n\n\n\nHost\nTo&nbsp;store (a website or other data) on a server or other computer so that it can be accessed over the Internet.\n\n\n\nIMAP\nIs an acronym for \"Internet Message Access Protocol\". It is one of the two most prevalent Internet standard protocols for e-mail retrieval, the other being the Post Office Protocol (POP). Virtually all modern e-mail clients and e-mail servers support both protocols as a means of transferring e-mail messages from a server.\n\n\n\nInstant Messaging\nInstant messaging or IM is a form of real-time text communication. See chat.\n\n\n\nIP Address\nIP is an acronym for \"Internet Protocol\". IP addresses are unique numbers that allow devices to locate information on a network. See Basic Guide to DNS\n\n\n\nLabels\nLabels are a Gmail feature that enables you to identify and find your messages. Labels are similar to folders but better: you can add more than one Label to an email message or email conversation. Messages that have a Label may be Archived or may remain in your inbox. Once you've created a Label, you may view all messages with that Label by clicking the Label name along the left side of any Gmail window.\n\n\n\nLabs\nAre a collection of new features that add functionality to your Gmail account. Google's continuous innovations are presented as labs, and mature lab features eventually graduate to be incorporated into Gmail's core service.\n\n\n\nLocked Content\nAdmins can lock the left column content of start pages with important information. Users will not be able to move or edit these areas. This feature won't be available in the accounts created after November 19th, 2007.\n\n\n\nMail Delegation\nIf this option is enabled, users can grant one another access to their e-mail accounts. That access permits specified users to read messages in that account, and to send messages on behalf of that account. Delegation is useful when someone wants to provide access to an assistant while away on vacation.\n\n\n\nMessage Security and Discovery\nThis is the old name for Message Security for Google Workspace.\n\n\n\nMessage Security for Google Workspace\nThis service allows administrators to have more granular control over spam, virus, and message filtering. This service is available in Google Workspace Basic, Google Workspace Business, and Google Workspace Education. For more information, see Message Security for Google Workspace in the Help Center.\n\n                    \n                                            \n                                        \n                        \n                            &laquo; Previous\n1\n&hellip;\n7\n8\n9\n10\n11\n&hellip;\n14\nNext &raquo;","excerpt":"Glossary Host To&nbsp;store (a website or other data) on a server or other computer so that it can be accessed..","path":"\/glossary-terms\/page\/9\/"},{"objectID":"477","title":"Recent Posts","content":"Recent Posts        \n                \n                    \n                 \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tInstant Messaging\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tHost\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tHeaders\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tHangouts\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tGoogolplex\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tGoogol\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tGoogle Voice and Voice and Video Chat Plugin\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tGoogle Video for Business\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tGoogle Talk Client\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tGoogle Sites\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n            \n                        \n                &laquo; Previous\n1\n&hellip;\n4\n5\n6\n7\n8\n&hellip;\n14\nNext &raquo;","excerpt":"Recent Posts October 19, 2022 Instant Messaging easyG Read More October 19, 2022 Host easyG Read More October 19, 2022..","path":"\/glossary\/page\/6\/"},{"objectID":"457","title":"Recent Posts","content":"Recent Posts        \n                \n                    \n                 \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tGoogle Plus\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tGoogle Mail\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tGoogle Hangout\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tGoogle Groups\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tGoogle Gadgets\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tGoogle Docs\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tGoogle Calendar\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tGoogle Cloud Partner\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tGoogle Workspace Migration for Novell GroupWise\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tGoogle Workspace Migration for Lotus Notes\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n            \n                        \n                &laquo; Previous\n1\n&hellip;\n5\n6\n7\n8\n9\n&hellip;\n14\nNext &raquo;","excerpt":"Recent Posts October 19, 2022 Google Plus easyG Read More October 19, 2022 Google Mail easyG Read More October 19,..","path":"\/glossary\/page\/7\/"},{"objectID":"375","title":"Recent Posts","content":"Recent Posts        \n                \n                    \n                 \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tDKIM\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tDirect delivery\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tCustom URL\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tCustom Logo\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tConversations or Conversation View\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tContent routing or attachment routing\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tContact Sharing\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tContact Information\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tConsumerization\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tCNAME Record\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n            \n                        \n                &laquo; Previous\n1\n&hellip;\n9\n10\n11\n12\n13\n14\nNext &raquo;","excerpt":"Recent Posts October 19, 2022 DKIM easyG Read More October 19, 2022 Direct delivery easyG Read More October 19, 2022..","path":"\/glossary\/page\/11\/"},{"objectID":"395","title":"Recent Posts","content":"Recent Posts        \n                \n                    \n                 \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tEasy\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tDual delivery \/ multiple delivery\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tDomain Registration\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tDomain Ownership\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tDomain Registrar\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tDomain Name\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tDomain Host\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tDomain Alias\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tDNS\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tDMARC\n\n\t\n\n\t\t\n\t\t\tDouglas Baumwall\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n            \n                        \n                &laquo; Previous\n1\n&hellip;\n8\n9\n10\n11\n12\n&hellip;\n14\nNext &raquo;","excerpt":"Recent Posts October 19, 2022 Easy easyG Read More October 19, 2022 Dual delivery \/ multiple delivery easyG Read More..","path":"\/glossary\/page\/10\/"},{"objectID":"435","title":"Recent Posts","content":"Recent Posts        \n                \n                    \n                 \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tGoogle Workspace Migration for Microsoft Outlook\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tGoogle Workspace Migration for Microsoft Exchange\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tGoogle Workspace Migration\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tBusiness Standard\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tGoogle Cloud Partners\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tGoogle Certified Deployment Specialist\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tGoogle Certified Sales Specialist\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tGoogle Workspace (formerly G Suite) editions\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tGoogle Apps (legacy free edition)\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tGoogle App Engine\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n            \n                        \n                &laquo; Previous\n1\n&hellip;\n6\n7\n8\n9\n10\n&hellip;\n14\nNext &raquo;","excerpt":"Recent Posts October 19, 2022 Google Workspace Migration for Microsoft Outlook easyG Read More October 19, 2022 Google Workspace Migration..","path":"\/glossary\/page\/8\/"},{"objectID":"415","title":"Recent Posts","content":"Recent Posts        \n                \n                    \n                 \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tGoogle Account\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tGoogle+\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tGooglePlex\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tGoogle\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tForm\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tFull Header\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tFilters\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tEmail Whitelist\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tEmail Migration\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n \n  \n    \n      \n      \n      \n      \n\t\tOctober 19, 2022\t  \n      \n\t\n  \n\tEmail Routing\n\n\t\n\n\t\t\n\t\t\teasyG\t\t\n\n\t\t\n\n\t\n\n\t\n\t\t\t\n\n\tRead More\n\n            \n                        \n                &laquo; Previous\n1\n&hellip;\n7\n8\n9\n10\n11\n&hellip;\n14\nNext &raquo;","excerpt":"Recent Posts October 19, 2022 Google Account easyG Read More October 19, 2022 Google+ easyG Read More October 19, 2022..","path":"\/glossary\/page\/9\/"}]